Repository: KDE/umbrello
Catalog: po/*/umbrello_kdevphp5.po
Languages: ar

# NAME OF TRANSLATORS
source: Your names
ar: زايد السعيدي

# EMAIL OF TRANSLATORS
source: Your emails
ar: zayed.alsaidi@gmail.com

source: Override
ar: تجاوز

source: Implement
ar: طبّق

source: From %1
ar: من %1

source: PHP Manual Integration
ar: دمج دليل PHP

source: <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN" "http://www.w3.org/TR/REC-html40/strict.dtd"> <html><head><meta name="qrichtext" content="1" /><style type="text/css"> p, li { white-space: pre-wrap; } </style></head><body style=" font-family:'DejaVu Sans'; font-size:8pt; font-weight:400; font-style:normal;"> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">By default the online <a href="http://php.net"><span style=" text-decoration: underline; color:#0000ff;">PHP documentation</span></a> is used remotely. Alternatively you can set the location to a local copy of the documentation in the language of your choice. Make sure you downloaded the <span style=" font-style:italic;">"Many HTML files"</span> package.</p></body></html>
ar: <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN" "http://www.w3.org/TR/REC-html40/strict.dtd"> <html><head><meta name="qrichtext" content="1" /><style type="text/css"> p, li { white-space: pre-wrap; } </style></head><body style=" font-family:'DejaVu Sans'; font-size:8pt; font-weight:400; font-style:normal;"> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">بشكل مبدئي، يُستخدَم <a href="http://php.net"><span style=" text-decoration: underline; color:#0000ff;">دليل PHP</span></a> المتاح على الإنترنت عن بُعد. بدلاً من ذلك، اضبط الموقع لنسخة محلية من الدليل بلغتك المفضّلة. تأكّد من تنزيل حزمة <span style=" font-style:italic;">"ملفات HTML المتعددة"</span>.</p></body></html>

source: Location:
ar: الموقع:

source: <lost declaration>
ar: <تصريح مفقود>

source: PHP Documentation
ar: توثيق بي اتش بي

source: Specifies the location of the PHP documentation to use.
ar: حدد موقع دليل PHP الذي تستخدمه.

source: The location of the PHP documentation to use. You can either use a remote location like https://php.net or a local directory which contains the PHP documentation in HTML format with many files.
ar: موقع دليل PHP الذي تستخدمه. لديك اختياران: إمّا موقع بعيد مثل https://php.net أو مجلد محلي يحتوي على دليل PHP بصيغة HTML وملفات متعددة.

source: Make sure local copies are downloaded in HTML format with many files.
ar: تأكّد من تنزيل النُسخ المحلية بصيغة HTML مع ملفات عديدة.

source: ...loading documentation...
ar: ...يُحمَّل الدليل...

source: Circular inheritance of %1 and %2
ar: توارث دائري لـ %1 و %2

source: Access type for interface method %1 must be omitted.
ar: يجب حذف نوع الوصول لتابِع الواجهة %1.

source: Interface function %1 cannot contain body.
ar: لا يمكن أن يحتوي تابع الواجهة %1 على جسد.

source: Class %1 contains abstract method %2 and must therefore be declared abstract or implement the method.
ar: يحتوي الصنف %1 على التابع المجرَّد %2، وعليه يجب إعلانه مُجرَّدًا أو طبّق التابِع.

source: Abstract function %1 cannot contain body.
ar: لا يمكن أن يحتوي التابع المجرَّد %1 على جسد.

source: Cannot use the final modifier on an abstract class member.
ar: لا يمكنك استخدام مُعدِّل 'final' على عضو صنف مجرَّد.

source: Non-abstract method %1 must contain body.
ar: يجب أن يحتوي التابِع غير المجرَّد %1 على جسد.

source: Properties cannot be declared final.
ar: لا يمكن إعلان الخاصيات كـ 'final'.

source: Properties cannot be declared abstract.
ar: لا يمكن إعلان الخاصيات كـ 'abstract'.

source: Trait method %1 has not been applied, because there are collisions with other trait methods on %2
ar: لم يطبَّق تابع السِمة %1، لوجود تعارضات مع توابع سِمة أخرى على %2

source: Cannot redeclare private property %1 from this context.
ar: لا يمكنك إعادة إعلان الخاصية الخاصة %1 من هذا السياق.

source: Cannot redeclare protected property %1 from this context.
ar: لا يمكنك إعادة إعلان الخاصية المحمية %1 من هذا السياق.

source: Traits cannot have constants.
ar: لا يمكن أن تحتوي السِمات على ثوابت.

source: Only booleans, ints, floats and strings are allowed for class constants.
ar: يُسمَح فقط بالبوليانية، والأعداد الصحيحة، والعائمة، والسلاسل لثوابت الصنف.

source: Cannot use 'final' as method modifier
ar: لا يمكنك استخدام 'final' كمُعدِّل تابع

source: Cannot use 'static' as method modifier
ar: لا يمكنك استخدام 'static' كمُعدِّل تابع

source: Default value for parameters with a class type hint can only be NULL.
ar: القيمة المبدئية للوسائط بتلميح نوع صنف يجب أن تكون NULL فقط.

source: Following parameters must have a default value assigned.
ar: يجب تعيين قيمة مبدئية للوسائط التالية.

source: Cannot redeclare PHP internal %1.
ar: لا يمكنك إعادة إعلان تابع PHP الداخلي %1.

source: %1 and %2 define the same property (%3) in the composition of %1. This might be incompatible, to improve maintainability consider using accessor methods in traits instead.
ar: يُعرِّف كل من %1 و %2 الخاصية نفسها (%3) في تكوين %1. قد يكون هذا غير متوافق، لتحسين القابلية للصيانة، فكّر في استخدام توابع الوصول في السِمات بدلاً من ذلك.

source: Cannot redeclare %1, already declared in %2 on line %3.
ar: لا يمكنك إعادة إعلان %1، فقد أُعلِن عنه بالفعل في %2 في السطر %3.

source: Class %1 contains %2 abstract methods and must therefore be declared abstract or implement the remaining methods.
ar: يحتوي الصنف %1 على %2 من التوابع المجرَّدة، وعليه يجب إعلانه مُجرَّدًا أو طبّق التوابع المتبقية.

source: Cannot re-assign $this.
ar: لا يمكنك إعادة تعيين $this.

source: The use statement with non-compound name '%1' has no effect.
ar: عبارة 'use' ذات الاسم غير المركّب '%1' ليس لها تأثير.

source: Cannot use '%1' as '%2' because the name is already in use.
ar: لا يمكنك استخدام '%1' كـ '%2' لأن الاسم قيد الاستخدام بالفعل.

source: Usage of %1 is deprecated.
ar: استخدام %1 مُهمل.

source: Declaration not found: %1
ar: التصريح غير موجود: %1

source: Lost trait alias %1
ar: اسم سِمة مستعار مفقود %1

source: Use of %1 from %2<br />
ar: استخدام %1 من %2<br />

source: Broken member alias trait.
ar: سِمة اسم عضو مستعار معطَّلة.

source: PHP internal
ar: داخلي لـ PHP

# kind of a php-constant, as shown in the declaration tooltip
source: Constant
ar: ثابت

source: magic constant
ar: ثابت سحري

source: empty (not inside a class)
ar: فارغ (ليس داخل صنف)

source: empty (not inside a method)
ar: فارغ (ليس داخل تابِع)

source: empty (not inside a function)
ar: فارغ (ليس داخل دالة)

source: empty (not inside a namespace)
ar: فارغ (ليس داخل فضاء أسماء)

source: current value: %1
ar: القيمة الحالية: %1

# as in list of int, set of string
source: %1 of %2
ar: %1 من %2

source: php-parser
ar: محلّل بي اتش بي

source: KDevelop PHP parser debugging utility
ar: أداة تصحيح محلّل PHP لـ KDevelop

source: (c) 2008 Niko Sams, 2009 Milian Wolff
ar: (ج) 2008 نيكو سامز، 2009 ميليان وولف

source: Could not open file '%1'
ar: تعذّر فتح الملف '%1'

source: File could not be read from.
ar: تعذّر القراءة من الملف.

source: File could not be opened.
ar: تعذّر فتح الملف.

source: File permissions prevent opening for read.
ar: تمنع أذونات الملف الفتح للقراءة.
