Repository: KDE/umbrello
Catalog: po/*/umbrello.po
Languages: ar

source: Closes the document
ar: يغلق المستند

source: Prints out the document
ar: يطبع المستند

source: Print Preview of the document
ar: معاينة طباعة المستند

source: Quits the application
ar: ينهي التَّطبيق

source: Exports the model to the docbook format
ar: يصدّر النموذج إلى تنسيق DocBook

source: Exports the model to the XHTML format
ar: يصدّر النموذج إلى تنسيق XHTML

source: Cuts the selected section and puts it to the clipboard
ar: يقُصُ المقطع المُنتقَى ويضعه في حافظة القُصاصات

source: Copies the selected section to the clipboard
ar: ينسخ المقطع المُنتقى إلى حافظة القُصاصات

source: Pastes the contents of the clipboard
ar: يلصق محتويات الحافظة

source: Undo last action
ar: تراجع عن الإجراء الأخير

source: Redo last undone action
ar: أعد الإجراء الأخير الذي تراجعت عنه

source: Set the default program preferences
ar: اضبط تفضيلات البرنامج المبدئية

# delete selected widget
source: Delete &Selected
ar: امحُ ال&محدد

source: &Class Diagram...
ar: &مخطط الفئة

source: &Object Diagram...
ar: مخطط &الكائن...

source: &Sequence Diagram...
ar: &مخطط التتابع

source: C&ommunication Diagram...
ar: مخطط ال&تواصل...

source: &Use Case Diagram...
ar: مخطط حالة ال&استخدام...

source: S&tate Diagram...
ar: مخطط ال&حالة…

source: &Activity Diagram...
ar: &مخطط النشاط...

source: Co&mponent Diagram...
ar: مخطط ال&مُكوِّن...

source: &Deployment Diagram...
ar: مخطط ال&نشر...

source: &Entity Relationship Diagram...
ar: مخطط &علاقة الكيان...

source: &Clear Diagram
ar: &امسح المخطط

source: &Snap to Grid
ar: &مطابقة للشبكة

source: S&how Grid
ar: أظهر ال&شبكة

source: &Delete Diagram
ar: &احذف المخطط

source: &Export as Picture...
ar: &صدّر كصورة...

source: Export &Diagrams as Pictures...
ar: صدّر ال&مخططات كصورة...

source: Z&oom to 100%
ar: &قرّب إلى 100٪

source: &Move Tab Left
ar: انقل اللسان لل&يسار

source: &Move Tab Right
ar: انقل اللسان للي&مين

source: Select Diagram on Left
ar: اختر مخططًا على اليسار

source: Select Diagram on Right
ar: اختر مخططًا على اليمين

# init status bar
source: Ready
ar: جاهز

source: Fit
ar: ناسب

source: Diagram Toolbar
ar: شريط أدوات المخططات

source: Opening file...
ar: يفتح الملف...

source: Untitled
ar: غير معنون

source: Creating new document...
ar: ينشئ مستندًا جديدًا...

source: Open File
ar: افتح الملف

source: *.xmi *.xmi.tgz *.xmi.tar.bz2 *.uml *.mdl *.zargo|All Supported Files (*.xmi, *.xmi.tgz, *.xmi.tar.bz2, *.uml, *.mdl, *.zargo) *.xmi|Uncompressed XMI Files (*.xmi) *.xmi.tgz|Gzip Compressed XMI Files (*.xmi.tgz) *.xmi.tar.bz2|Bzip2 Compressed XMI Files (*.xmi.tar.bz2) *.uml|Eclipse PapyrusUML files (*.uml) *.mdl|Rose model files (*.mdl) *.zargo|Compressed argo Files(*.zargo)
ar: *.xmi *.xmi.tgz *.xmi.tar.bz2 *.uml *.mdl *.zargo|كل الملفات المدعومة (*.xmi, *.xmi.tgz, *.xmi.tar.bz2, *.uml, *.mdl, *.zargo) *.xmi|ملفات XMI غير مضغوطة (*.xmi) *.xmi.tgz|ملفات XMI مضغوطة بـ Gzip (*.xmi.tgz) *.xmi.tar.bz2|ملفات XMI مضغوطة بـ Bzip2 (*.xmi.tar.bz2) *.uml|ملفات Eclipse PapyrusUML (*.uml) *.mdl|ملفات نموذج Rose (*.mdl) *.zargo|ملفات argo مضغوطة (*.zargo)

source: Saving file...
ar: يحفظ الملفّ...

source: Saving file with a new filename...
ar: يحفظ الملفّ باسم ملفّ جديد...

source: Save As
ar: احفظ كَ‍

source: *.xmi | XMI File (*.xmi);;*.xmi.tgz | Gzip Compressed XMI File (*.xmi.tgz);;*.xmi.tar.bz2 | Bzip2 Compressed XMI File (*.xmi.tar.bz2);;* | All Files (*)
ar: *.xmi | ملف XMI ‏(*.xmi);;*.xmi.tgz | ملف XMI مضغوط بـ Gzip (*.xmi.tgz);;*.xmi.tar.bz2 | ملف XMI مضغوط بـ Bzip2 (*.xmi.tar.bz2);;* | كل الملفات (*)

source: The file %1 exists. Do you wish to overwrite it?
ar: الملف %1 موجود. أتود استبداله؟

source: Warning
ar: تحذير

source: Overwrite
ar: استبدل

source: Closing file...
ar: يغلق الملفّ...

source: No search term entered
ar: لا يوجد مصطلح بحث مدخل

source: '%1': %2 found
ar: '%1': وُجد %2

source: Print Preview...
ar: معاينة الطباعة...

source: Printing...
ar: يطبع...

source: Print %1
ar: اطبع %1

source: Exiting...
ar: خروج...

source: Cutting selection...
ar: جاري قطع الإختيار...

source: Copying selection to clipboard...
ar: جاري نسخ الإختيار الى الحافظة...

source: Inserting clipboard contents...
ar: جاري إدراج محتويات الحافظة...

source: Umbrello could not paste the clipboard contents. The objects in the clipboard may be of the wrong type to be pasted here.
ar: لم يستطع أمبريلو لصق محتويات الحافظة. قد تكون الكائنات الموجودة في الحافظة من نوع خاطئ لا يمكن لصقه هنا.

# reset status bar
source: Ready.
ar: جاهز.

source: Cannot view code until you generate some first.
ar: لا تستطيع عرض الشفرة إلا بعد أن تولّد بعضها أولًا.

source: Cannot View Code
ar: لا تستطيع عرض الشفرة

source: Cannot view code from simple code writer.
ar: لا تستطيع عرض الشفرة من كاتب شفرة بسيط.

source: Select file(s) to import:
ar: اختر ملف (ملفات) للاستيراد:

source: Select directory to import:
ar: اختر مجلدًا للاستيراد:

source: XHTML Generation failed .
ar: فشل توليد XHTML.

source: Show/hide window
ar: اعرض/أخفِ الشبكة

source: &Bird's eye view
ar: &منظور عين الطائر

source: Co&mmand history
ar: سجل ال&أوامر

source: &Debug
ar: تن&قيح

source: Doc&umentation
ar: ال&توثيق

source: &Log
ar: سجل

source: &UML Objects
ar: كائنات &UML

source: &Stereotypes
ar: &أنماط

source: &Tree View
ar: &عرض الشّجرة

source: Welcome
ar: مرحباً

source: UML Model
ar: نموذج UML

source: Logical View
ar: عرض منطقي

source: Use Case View
ar: عرض حالة الاستخدام

source: Component View
ar: عرض المُكوِّن

source: Deployment View
ar: عرض النشر

source: Entity Relationship Model
ar: نموذج علاقة الكيان

source: Datatypes
ar: أنواع البيانات

source: The current file has been modified. Do you want to save it?
ar: الملف الحالي قد عُدّل. أتود حفظه؟

# warning message
source: Warning
ar: تحذير

source: The file <%1> does not exist.
ar: الملف <%1> غير موجود.

source: Load Error
ar: خطأ أثناء التحميل

source: The file %1 seems to be corrupted.
ar: يبدو أن الملف %1 فاسد.

source: There was no XMI file found in the compressed file %1.
ar: لم يُعثر على ملف XMI في الملف المضغوط %1.

source: There was a problem loading the extracted file: %1
ar: حدثت مشكلة في تحميل الملف المستخرج: %1

source: There was a problem loading file: %1
ar: حدثت مشكلة في تحميل الملف: %1

source: Reason: %1
ar: السّبب: %1

source: There was a problem saving: %1
ar: حدثت مشكلة في الحفظ: %1

source: Save Error
ar: خطأ أثناء الحفظ

source: There was a problem uploading: %1
ar: حدثت مشكلة في الرفع: %1

source: use case diagram
ar: مخطط حالة الاستخدام

source: class diagram
ar: مخطط الفئة

source: sequence diagram
ar: مخطط التتابع

source: communication diagram
ar: مخطط التواصل

source: object diagram
ar: مخطط الكائن

source: state diagram
ar: مخطط الحالة

source: activity diagram
ar: مخطط النشاط

source: component diagram
ar: مخطط المُكوِّن

source: deployment diagram
ar: مخطط النشر

source: entity relationship diagram
ar: مخطط علاقة الكيان

# diagram name
source: Name
ar: الاسم

source: Enter name:
ar: أدخل الاسم:

source: That is an invalid name for a diagram.
ar: هذا اسم غير صالح لمخطط.

source: A diagram is already using that name.
ar: مخطط آخر يستخدم هذا الاسم بالفعل.

# renaming diagram
source: Name
ar: الاسم

# renaming uml object
source: Name
ar: الاسم

# renaming child uml object
source: Name
ar: الاسم

source: The name you entered was not unique. Is this what you wanted?
ar: الاسم الذي أدخلته غير فريد. هل هذا ما أردته؟

source: Use Name
ar: استخدِم الاسم

source: Enter New Name
ar: أدخل الاسم الجديد:

source: Unsupported xmi file version: %1
ar: إصدار ملف XMI غير مدعوم: %1

source: Setting up the document...
ar: إعداد المستند...

source: Resolving object references...
ar: حل مراجع الكائنات...

source: Loading UML elements...
ar: تحميل عناصر UML...

source: Loading diagrams...
ar: تحميل المخططات...

source: /autosave%1
ar: /حفظ_آلي%1

source: Externalize Folder
ar: إخراج المجلد

source: Folder %1 must be relative to the main model directory, %2.
ar: يجب أن يكون المجلد %1 نسبيًا إلى مجلد النموذج الرئيسي، %2.

source: Path Error
ar: خطأ في المسار

source: File %1 already exists! The existing file will be overwritten.
ar: الملف %1 موجود بالفعل! الملف الموجود سوف يُستبدل.

source: File Exists
ar: الملف موجود

source: There was a problem saving file: %1
ar: حدثت مشكلة في حفظ الملف: %1

source: Enter Model Name
ar: أدخِل اسم النموذج

source: Enter the new name of the model:
ar: أدخِل الاسم الجديد للنموذج:

source: Views
ar: العروض

source: Settings
ar: إعدادات

source: Loading listview...
ar: تحميل عرض القائمة...

source: The class must be emptied before it can be deleted.
ar: يجب تفريغ الفئة قبل حذفها.

source: Class Not Empty
ar: الفئة ليست فارغة

source: The package must be emptied before it can be deleted.
ar: يجب تفريغ الحزمة قبل حذفها.

source: Package Not Empty
ar: الحزمة ليست فارغة

source: The folder must be emptied before it can be deleted.
ar: يجب تفريغ المجلد قبل حذفه.

source: Folder Not Empty
ar: المجلد ليس فارغًا

source: Rename canceled
ar: إلغاء إعادة التسمية

source: Renaming an item of listview type %1 is not yet implemented.
ar: إعادة تسمية عنصر من نوع عرض القائمة %1 لم يُطبّق بعد.

source: Function Not Implemented
ar: الدالة لم تُطبّق

source: The name you entered was invalid. Renaming process has been canceled.
ar: الاسم الذي أدخلته غير صالح. عملية إعادة التسمية قد أُلغيت.

source: Name Not Valid
ar: الاسم غير صالح

source: new_literal
ar: حرفي_جديد

source: new_field
ar: حقل_جديد

source: new_fkey_constraint
ar: قيد_مفتاح_خارجي_جديد

source: An operation with the same name and signature already exists. You cannot add it again.
ar: عملية تحمل الاسم والتوقيع ذاته موجودة بالفعل. لا تستطيع إضافتها مرة أخرى.

source: The folderfile %1 does not exist.
ar: ملف المجلد %1 غير موجود.

source: The folderfile %1 cannot be opened.
ar: ملف المجلد %1 لا يمكن فتحه.

source: Actor &name:
ar: اسم &الممثل:

source: Artifact &name:
ar: اسم &القطعة الأثرية:

source: Association &name:
ar: اسم &الترافق:

source: Class &name:
ar: اسم &الفئة:

source: Component &name:
ar: اسم &المُكوِّن:

source: Datatype &name:
ar: اسم &نوع البيانات:

source: Entity &name:
ar: اسم &الكيان:

source: Enum &name:
ar: اسم &التعداد:

source: Folder &name:
ar: اسم ال&مجلد:

source: Interface &name:
ar: اسم ال&واجهة:

source: Node &name:
ar: اسم &العقدة:

source: Package &name:
ar: اسم &الحزمة:

source: Port &name:
ar: اسم &المنفذ:

source: Use case &name:
ar: اسم حالة ال&استخدام:

source: Instance name:
ar: اسم النسخة:

source: new_parameter
ar: وسيط_جديد

# object name
source: Name
ar: الاسم

source: An object with the name %1 already exists in the package %2. Please enter a new name:
ar: كائن يحمل الاسم %1 موجود بالفعل في الحزمة %2. أدخِل اسمًا جديدًا من فضلك:

source: Diagram: %2 Page %1
ar: المخطط: %2 الصفحة %1

source: Use fill color
ar: استخدم لون التعبئة

source: No fill color
ar: لا يوجد لون تعبئة

source: Change font
ar: غيّر الخط

source: Change line color
ar: غيّر لون الخط

source: Change line width
ar: غيّر عرض الخط

source: Change fill color
ar: غيّر لون التعبئة

source: Change visual property
ar: غيّر الخاصية البصرية

source: Delete widgets
ar: احذف الودجات

source: Resize widgets
ar: غيّر حجم الودجات

source: Enter Diagram Name
ar: أدخِل اسم المخطط

source: Enter the new name of the diagram:
ar: أدخِل الاسم الجديد للمخطط:

source: Failed to import from file.
ar: فشل الاستيراد من الملف.

source: Exporting view...
ar: تصدير العرض...

source: An error happened when exporting the image:
ar: حدث خطأ أثناء تصدير الصورة:

source: The selected file %1 exists. Do you want to overwrite it?
ar: الملف المحدد %1 موجود. أتود استبداله؟

source: File Already Exists
ar: الملفّ موجود فعلًا

source: Empty scene
ar: مشهد فارغ

source: Cannot create directory: %1
ar: تعذّر إنشاء الدّليل: %1

source: A problem occurred while saving diagram in %1
ar: حدثت مشكلة أثناء حفظ المخطط في %1

source: Multiplicity
ar: التعددية

source: Enter multiplicity:
ar: أدخِل التعددية:

source: Association Name
ar: اسم الترافق

source: Enter association name:
ar: أدخِل اسم الترافق:

source: Role Name
ar: اسم الدور

source: Enter role name:
ar: أدخِل اسم الدور:

source: Press Ctrl with left mouse click to delete a point
ar: اضغط Ctrl مع نقرة زر الفأرة الأيسر لحذف نقطة

source: Enter the name of the diagram referenced
ar: أدخِل اسم المخطط المرجعي

source: Diagram name
ar: اسم المخطط

source: Enter the guard of the loop
ar: أدخِل حارس الحلقة

source: Enter the first alternative name
ar: أدخِل اسم البديل الأول

source: Enter first alternative
ar: أدخِل البديل الأول

source: Enter first alternative :
ar: أدخِل البديل الأول :

source: Enter referenced diagram name
ar: أدخِل اسم المخطط المرجعي

source: Enter referenced diagram name :
ar: أدخِل اسم المخطط المرجعي :

source: Enter the guard of the loop:
ar: أدخِل حارس الحلقة:

source: Enter alternative Name
ar: أدخِل اسم البديل

source: Enter the alternative:
ar: أدخِل البديل:

source: Change Text
ar: غيّر النص

source: Enter new text:
ar: أدخِل نصًا جديدًا:

source: ERROR
ar: خطأ

# operation name
source: Name
ar: الاسم

source: Enter operation name:
ar: أدخِل اسم العملية:

source: Precondition
ar: شرط مُسبَق

source: Postcondition
ar: شرط لاحق

source: Transformation
ar: التحويل

source: Note Type
ar: نوع الملاحظة

source: Select the Note Type
ar: اختر نوع الملاحظة

source: Enter Object Node Name
ar: أدخِل اسم عقدة الكائن

source: Enter the name of the object node :
ar: أدخِل اسم عقدة الكائن :

source: Select Object node type
ar: اختر نوع عقدة الكائن

source: Select the object node type
ar: اختر نوع عقدة الكائن

source: Enter the name of the data store node
ar: أدخِل اسم عقدة مخزن البيانات

source: data store name
ar: اسم مخزن البيانات

source: Enter the name of the buffer node
ar: أدخِل اسم عقدة المخزن المؤقت

source: Enter the name of the buffer
ar: أدخِل اسم المخزن المؤقت

source: centralBuffer
ar: مخزن_مؤقت_مركزي

source: Enter the name of the object flow
ar: أدخِل اسم تدفق الكائن

source: object flow
ar: تدفق الكائن

source: Enter Object Flow State
ar: أدخِل حالة تدفق الكائن

source: Enter State (keep '-' if there is no state for the object)
ar: أدخِل الحالة (أبْقِ '-' إن لم تكن هناك حالة للكائن)

source: Enter signal name
ar: أدخِل اسم الإشارة

source: Enter the signal name :
ar: أدخِل اسم الإشارة :

source: Enter Activity
ar: أدخِل النشاط

source: Hold shift or ctrl to move in X axis. Hold shift and control to move in Y axis. Right button click to cancel move.
ar: اضغط على shift أو ctrl للتحريك في المحور السيني. اضغط shift و control للتحريك في المحور الصادي. انقر بالزر الأيمن لإلغاء التحريك.

source: Move widgets
ar: حرّك الودجات

source: Rename Object
ar: أعد تسمية الكائن

source: Enter object name:
ar: أدخِل اسم الكائن:

source: Hold shift or control to move in X axis.
ar: اضغط على shift أو control للتحريك في المحور السيني.

source: Hold shift and control to move in Y axis.
ar: اضغط على shift و control للتحريك في المحور الصادي.

source: new actor
ar: ممثل جديد

source: new artifact
ar: قطعة أثرية جديدة

source: new association
ar: ترافق جديد

source: new box
ar: صندوق جديد

source: new category
ar: فئة جديدة

source: new class
ar: فئة جديدة

source: new combined fragment
ar: جزء مدمج جديد

source: new component
ar: مُكوِّن جديد

source: new datatype
ar: نوع بيانات جديد

source: new entity
ar: كيان جديد

source: new enum
ar: تعداد جديد

source: new floating dash line
ar: خط متقطع عائم جديد

source: new fork/join
ar: تشعّب/انضمام جديد

source: new instance
ar: نسخة جديدة

source: new interface
ar: واجهة جديدة

source: new message
ar: رسالة جديدة

source: new node
ar: عقدة جديدة

source: new note
ar: ملاحظة جديدة

source: new object
ar: كائن جديد

source: new object node
ar: عقدة كائن جديدة

source: new package
ar: حزمة جديدة

source: new pin
ar: مسمار جديد

source: new port
ar: منفذ جديد

source: new precondition
ar: شرط مُسبَق جديد

source: new region
ar: منطقة جديدة

source: new signal
ar: إشارة جديدة

source: new text
ar: النص الجديد

source: new UML widget
ar: ودجة UML جديدة

source: new use case
ar: حالة استعمال جديدة

source: new widget
ar: ويجت جديدة

source: New activity
ar: نشاط جديد

source: New box
ar: صندوق جديد

source: New combined fragment
ar: مقطع مدمج جديد

source: New floating dash line
ar: خط تقطيع عائم جديد

source: New fork/join
ar: انقسام/انضمام جديد

source: New message
ar: رسالة جديدة

source: New note
ar: ملاحظة جديدة

source: New object
ar: كائن جديد

source: New object node
ar: عقدة كائن جديدة

source: New pin
ar: دبوس جديد

source: New precondition
ar: شرط مبدئي جديد

source: New region
ar: منطقة جديدة

source: New signal
ar: إشارة جديدة

source: New state
ar: حالة جديدة

source: New text
ar: نص جديد

source: New UML widget
ar: ويجت UML جديد

source: New widget
ar: ويجت جديد

source: Enter the name of the new box:
ar: أدخل اسم الصندوق الجديد:

source: Enter the name of the new combined fragment:
ar: أدخل اسم المقطع المدمج الجديد:

source: Enter the name of the new floating dash line:
ar: أدخل اسم خط التقطيع العائم الجديد:

source: Enter the name of the new fork/join:
ar: أدخل اسم الانقسام/الانضمام الجديد:

source: Enter the name of the new message:
ar: أدخل اسم الرسالة الجديدة:

source: Enter the name of the new note:
ar: أدخل اسم الملاحظة الجديدة:

source: Enter the name of the new object:
ar: أدخل اسم الكائن الجديد:

source: Enter the name of the new object node:
ar: أدخل اسم عقدة الكائن الجديدة:

source: Enter the name of the new pin:
ar: أدخل اسم الدبوس الجديد:

source: Enter the name of the new precondition:
ar: أدخل اسم الشرط المبدئي الجديد:

source: Enter the name of the new region:
ar: أدخل اسم المنطقة الجديدة:

source: Enter the name of the new signal:
ar: أدخل اسم الإشارة الجديدة:

source: Enter the name of the new text:
ar: أدخل اسم النص الجديد:

source: Enter the name of the new uml widget:
ar: أدخل اسم ويجت uml الجديد:

source: Enter the name of the new widget:
ar: أدخل اسم الويجت الجديد:

source: Rename activity
ar: أعد تسمية النشاط

source: Rename box
ar: أعد تسمية الصندوق

source: Rename combined fragment
ar: أعد تسمية المقطع المدمج

source: Rename floating dash line
ar: أعد تسمية خط التقطيع العائم

source: Rename fork/join
ar: أعد تسمية الانقسام/الانضمام

source: Rename message
ar: أعد تسمية الرسالة

source: Rename note
ar: غيّر اسم الملاحظة

source: Rename object
ar: أعد تسمية الكائن

source: Rename object node
ar: أعد تسمية عقدة الكائن

source: Rename pin
ar: أعد تسمية الدبوس

source: Rename precondition
ar: أعد تسمية الشرط المبدئي

source: Rename region
ar: أعد تسمية المنطقة

source: Rename signal
ar: أعد تسمية الإشارة

source: Rename state
ar: أعد تسمية الحالة

source: Rename text
ar: أعد تسمية النص

source: Rename UML widget
ar: أعد تسمية ويجت UML

source: Rename widget
ar: أعد تسمية الويجت

source: Enter the new name of the activity:
ar: أدخل الاسم الجديد للنشاط:

source: Enter the new name of the box:
ar: أدخل الاسم الجديد للصندوق:

source: Enter the new name of the combined fragment:
ar: أدخل الاسم الجديد للمقطع المدمج:

source: Enter the new name of the floating dash line:
ar: أدخل الاسم الجديد لخط التقطيع العائم:

source: Enter the new name of the fork/join widget:
ar: أدخل الاسم الجديد لويجت الانقسام/الانضمام:

source: Enter the new name of the message:
ar: أدخل الاسم الجديد للرسالة:

source: Enter the new name of the note:
ar: أدخل الاسم الجديد للملاحظة:

source: Enter the new name of the object:
ar: أدخل الاسم الجديد للكائن:

source: Enter the new name of the object node:
ar: أدخل الاسم الجديد لعقدة الكائن:

source: Enter the new name of the pin:
ar: أدخل الاسم الجديد للدبوس:

source: Enter the new name of the precondition:
ar: أدخل الاسم الجديد للشرط المبدئي:

source: Enter the new name of the region:
ar: أدخل الاسم الجديد للمنطقة:

source: Enter the new name of the signal:
ar: أدخل الاسم الجديد للإشارة:

source: Enter the new name of the state:
ar: أدخل الاسم الجديد للحالة:

source: Enter the new name of the text:
ar: أدخل الاسم الجديد للنص:

source: Enter the new name of the uml widget:
ar: أدخل الاسم الجديد لويجت uml:

source: Enter the new name of the widget:
ar: أدخل الاسم الجديد للويجت:

source: Box
ar: الصندوق

source: CombinedFragment
ar: مقطع مدمج

source: Datatype
ar: نوع البيانات

source: Enum
ar: تعداد

source: FloatingDashLine
ar: خط تقطيع عائم

source: ForkJoin
ar: انقسام/انضمام

source: Message
ar: الرسالة

source: Note
ar: الملاحظة

source: Object
ar: الكائن

source: ObjectNode
ar: عقدة كائن

source: Signal
ar: الاشارة

source: State
ar: الحالة

source: Text
ar: النص

source: UseCase
ar: حالة استعمال

source: Instance
ar: نسخة

# selection arrow
source: Select
ar: اختر

source: Creation
ar: إنشاء

source: Destroy
ar: تدمير

source: Combined Fragment
ar: مقطع مدمج

source: Label
ar: اللصيقة

source: Directional Association
ar: اقتران اتجاهي

# UML class
source: Class
ar: صنف

source: Send signal
ar: أرسل إشارة

source: Accept signal
ar: اقبل إشارة

source: Accept time event
ar: اقبل حدث الوقت

source: Fork/Join
ar: انقسام/انضمام

source: Interface Provider
ar: موفّر الواجهة

source: Interface required
ar: واجهة مطلوبة

# join states
source: Join
ar: انضمام

# state choice
source: Choice
ar: اختيار

source: And Line
ar: خط العطف

# state diagram
source: State
ar: الحالة

source: Pre/Post condition
ar: شرط مبدئي/لاحق
