Repository: KDE/umbrello
Catalog: po/*/umbrello.po
Languages: ar

# NAME OF TRANSLATORS
source: Your names
ar: زايد السعيدي

# EMAIL OF TRANSLATORS
source: Your emails
ar: zayed.alsaidi@gmail.com

source: Class Diagram
ar: مخطط الفئة

source: Use Case Diagram
ar: مخطط حالة الاستعمال

source: Sequence Diagram
ar: مخطط التتابع

source: Collaboration Diagram
ar: مخطط التعاون

source: State Diagram
ar: مخطط الحالة

source: Activity Diagram
ar: مخطط النشاط

source: Component Diagram
ar: مخطط المكوّن

source: Deployment Diagram
ar: مخطط النشر

source: Entity Relationship Diagram
ar: مخطط علاقة الكيان

source: Object Diagram
ar: مخطط الكائن

source: No Diagram
ar: لا يوجد مخطط

source: Generalization
ar: تعميم

source: Aggregation
ar: التّجميع

source: Dependency
ar: الاعتمادية

source: Association
ar: جمعية

source: Self Association
ar: ترابط ذاتي

source: Collaboration Asynchronous Message
ar: رسالة تعاون غير متزامنة

source: Collaboration Synchronous Message
ar: رسالة تعاون متزامنة

source: Sequence Message
ar: رسالة تسلسل

source: Collaboration Self Message
ar: رسالة تعاون ذاتية

source: Sequence Self Message
ar: رسالة تسلسل ذاتية

source: Containment
ar: الاحتواء

source: Composition
ar: التّراكب

source: Realization
ar: التحقق

source: Uni Association
ar: ترابط أحادي

source: Anchor
ar: المرساة

source: State Transition
ar: انتقال حالة

source: Activity
ar: النّشاط

source: Exception
ar: استثناء

source: Category to Parent
ar: الفئة إلى الأصل

source: Child to Category
ar: الفرع إلى الفئة

source: Relationship
ar: علاقة

source: Unknown
ar: مجهول

source: ? AssociationType ?
ar: ؟ نوع الترابط ؟

source: At least one of the items in the clipboard could not be pasted because an item of the same name already exists. Any other items have been pasted.
ar: لا يمكن لصق عنصر واحد على الأقل من العناصر الموجودة في الحافظة لوجود عنصر بالاسم ذاته. لُصقت أية عناصر أخرى.

source: Paste Error
ar: خطأ اللصق

source: Create diagram %1: %2
ar: أنشئ المخطط %1: %2

source: Change text : %1 to %2
ar: غيّر النص: %1 إلى %2

source: Remove diagram %1
ar: أزل المخطط %1

source: Set stereotype : %1 to %2
ar: اضبط النمط النمطي: %1 إلى %2

source: Change visibility : %1
ar: غيّر الرؤية: %1

source: Create UML object : %1
ar: أنشئ كائن UML: %1

source: Remove UML object : %1
ar: أزل كائن UML: %1

source: Rename object : %1 to %2
ar: أعد تسمية الكائن: %1 إلى %2

source: Change fill color : %1
ar: غيّر لون التعبئة: %1

source: Change font : %1
ar: غيّر الخط: %1

source: Change line color : %1
ar: غيّر لون الخط: %1

source: Change line width : %1
ar: غيّر عرض الخط: %1

source: Change multiplicity : %1 to %2
ar: غيّر التعدد: %1 إلى %2

source: Change text color : %1
ar: غيّر لون النص: %1

source: Use fill color : %1
ar: استخدم لون التعبئة: %1

source: No fill color : %1
ar: لا يوجد لون تعبئة: %1

source: Change visual property : %1
ar: غيّر الخاصية المرئية: %1

source: Create widget : %1
ar: أنشئ عنصر واجهة: %1

source: Move widget : %1
ar: حرّك عنصر واجهة: %1

source: Remove widget : %1
ar: أزل عنصر واجهة: %1

source: Resize widget : %1
ar: غيّر حجم عنصر واجهة: %1

source: Set name : %1 to %2
ar: اضبط الاسم: %1 إلى %2

source: Set text : %1 to %2
ar: اضبط النص: %1 إلى %2

source: Cannot open file %1 for writing. Please make sure the folder exists and you have permissions to write to it.
ar: لا يمكن فتح الملف %1 للكتابة. رجاءً تأكد من وجود المجلد وامتلاكك أذونات الكتابة فيه.

source: Cannot Open File
ar: تعذّر فتح الملفّ

source: Cannot create the folder:
ar: لا يمكن إنشاء المجلد:

source: Please check the access rights
ar: رجاءً تفقد حقوق الوصول

source: Cannot Create Folder
ar: تعذّر إنشاء المجلّد

source: Package is a namespace
ar: الحزمة هي فضاء اسم

source: Virtual destructors
ar: مهدمات افتراضية

source: Generate empty constructors
ar: وَلِّد مُنشِئات فارغة

source: Generate accessor methods
ar: وَلِّد وسائل الكسب

source: Operations are inline
ar: العمليات مدمجة (inline)

source: Accessors are inline
ar: الكاسبات مدمجة (inline)

source: Accessors are public
ar: الكاسبات عامة (public)

source: Create getters with 'get' prefix
ar: أنشئ حاصِلات ذات بادئة 'get'

source: Remove prefix '[a-zA-Z]_' from accessor method names
ar: أزل البادئة '[a-zA-Z]_' من أسماء وسائل الكسب

source: Accessor methods start with capital letters
ar: تبدأ وسائل الكسب بحروف كبيرة

source: Use '\' as documentation tag instead of '@'
ar: استخدم '\' كوسم توثيق بدلًا من '@'

source: <p align="center">C++ Code Generation</p>
ar: <p align="center">توليد شيفرة C++</p>

source: General
ar: عامّ

source: Class member prefix
ar: بادئة عضو الفئة

source: Method Body Generation
ar: توليد جسم الوسيلة

source: <b>Variable</b>
ar: <b>متغير</b>

source: string
ar: نصّ

source: <p align="center">String</p>
ar: <p align="center">نصّ</p>

source: <p align="center">List</p>
ar: <p align="center">قائمة</p>

source: <i>global?</i>
ar: <i>عام؟</i>

source: Class name
ar: اسم الفئة

source: <i><p align="center">Include file</p></i>
ar: <i><p align="center">ملف تضمين</p></i>

source: Use following for classes in generated code:
ar: استخدم ما يلي للفئات في الشيفرة الموّلدة:

source: Documentation
ar: التوثيق

source: Style:
ar: النمط:

source: Slash-Slash (//)
ar: شرطة مائلة-شرطة مائلة (//)

source: Slash-Star (/** */)
ar: شرطة مائلة-نجمة (/** */)

source: Project Generation
ar: توليد المشروع

source: Create ANT build document
ar: أنشئ وثيقة بناء ANT

source: Auto-Generate Methods
ar: وسائل توليد آلي

source: Empty constructor methods
ar: وسائل المُنشِئ الفارغة

source: Association accessor methods
ar: وسائل كسب الترابط

source: Attribute accessor methods
ar: وسائل كسب السمة

source: Default attribute accessor scope:
ar: نطاق كاسب السمة مبدئي:

source: Public
ar: عام

source: Private
ar: خاص

source: Protected
ar: محمي

source: From Parent Object
ar: من الكائن الأصل

source: Default association field scope:
ar: نطاق حقل الترابط مبدئي:

source: From Parent Role
ar: من دور الأصل

source: <p align="center">D Code Generation</p>
ar: <p align="center">توليد شيفرة D</p>

source: <p align="center">Java Code Generation</p>
ar: <p align="center">توليد شيفرة Java</p>

source: <p align="center">Ruby Code Generation</p>
ar: <p align="center">توليد شيفرة Ruby</p>

source: Hash (#)
ar: التلبيدة (#)

source: Begin-End (=begin =end)
ar: بداية-نهاية (=begin =end)

source: Auto-Generated Methods
ar: وسائل مولّدة آليًا

source: Code Generation Wizard
ar: معالج توليد الشيفرة

source: Code Generation Options
ar: خيارات توليد الشيفرة

source: Adjust code generation options.
ar: اضبط خيارات توليد الشيفرة.

source: Language Options
ar: خيارات اللغة

source: The output folder exists, but it is not writable. Please set the appropriate permissions or choose another folder.
ar: مجلد الخرج موجود، لكنه غير قابل للكتابة. رجاءً اضبط الأذونات المناسبة أو اختر مجلدًا آخر.

source: Error Writing to Output Folder
ar: خطأ في الكتابة إلى مجلد الخرج

source: %1 does not seem to be a folder. Please choose a valid folder.
ar: لا يبدو %1 مجلدًا. رجاءً اختر مجلدًا صالحًا.

source: Please Choose Valid Folder
ar: رجاءً اختر مجلدًا صالحًا

source: The folder %1 does not exist. Do you want to create it now?
ar: المجلد %1 غير موجود. هل تود إنشاءه الآن؟

source: Output Folder Does Not Exist
ar: مجلد الخرج غير موجود

source: Create Folder
ar: أنشئ مجلّدًا

source: Do Not Create
ar: لا تنشيء

source: The folder could not be created. Please make sure you have write access to its parent folder or select another, valid, folder.
ar: لا يمكن إنشاء المجلد. رجاءً تأكد من امتلاكك صلاحية الكتابة في المجلد الأب أو اختر مجلدًا آخر صالحًا.

source: Error Creating Folder
ar: خطأ في إنشاء المجلّد

source: Please select a valid folder.
ar: رجاءً اختر مجلدًا صالحًا.

source: Language
ar: اللغة

source: Folders
ar: المجلّدات

source: Write all generated files to folder:
ar: اكتب كل الملفات المولّدة إلى المجلد:

source: Files generated by Code Generator will be written to this folder
ar: الملفات المولّدة بواسطة مولد الشيفرة ستكتب إلى هذا المجلد

source: Bro&wse...
ar: &تصفّح...

source: &Include heading files from folder:
ar: &ضمّن ملفات العناوين من المجلد:

source: Files in this folder will be used as heading files in the generated code
ar: الملفات في هذا المجلد ستستخدم كملفات عناوين في الشيفرة الموّلدة

source: B&rowse...
ar: &تصفّح...

source: Overwrite Policy
ar: سياسة الكتابة فوق

source: If a file with the same name as the name code generator wants to use as output file already exists:
ar: إذا وجد ملف بالاسم نفسه الذي يريد مولد الشيفرة استخدامه كملف خرج فعلًا:

source: Overwrite existing files if they exist in the destination folder
ar: اكتب فوق الملفات الموجودة إذا وُجدت في مجلد الوجهة

source: O&verwrite
ar: ا&ستبدل

source: If a file with the same name already exists, ask what to do
ar: إذا وجد ملف بالاسم نفسه فعلًا، اسأل عما يجب فعله

source: As&k
ar: اس&أل

source: If a file already exists in the destination folder, select a different name to use by adding a suffix to the file name
ar: إذا وجد ملف فعلًا في مجلد الوجهة، اختر اسمًا مختلفًا للاستخدام بإضافة لاحقة لاسم الملف

source: &Use a different name
ar: &استخدم اسمًا مختلفًا

source: Formatting
ar: التهيئة

source: Comment Verbosity
ar: إسهاب التعليق

source: Write comments &for class and method documentation even if empty
ar: اكتب تعليقات &لتوثيق الفئة والوسيلة حتى لو كانت فارغة

source: &Write documentation comments even if empty
ar: &اكتب تعليقات التوثيق حتى لو كانت فارغة

source: Write section comments:
ar: اكتب تعليقات القسم:

source: Writes comments to indicate the different sections (public, private etc) in a class, even if the sections are empty
ar: يكتب تعليقات للدلالة على الأقسام المختلفة (عامة، خاصة إلخ) في فئة، حتى لو كانت الأقسام فارغة

source: None
ar: لا شيء

source: When section is non empty
ar: عندما يكون القسم غير فارغ

source: Always
ar: دائمًا

source: Lines
ar: الخطوط

source: Indentation type:
ar: نوع الإزاحة:

source: No Indentation
ar: بلا إزاحة

source: Tab
ar: محرف جدولة

source: Space
ar: مسافة

source: Indentation amount:
ar: مقدار الإزاحة:

source: Line ending style:
ar: نمط نهاية السطر:

source: *NIX ("\n")
ar: يونكس ("\n")

source: Windows ("\r\n")
ar: وندوز ("\r\n")

source: Mac ("\r")
ar: ماك ("\r")

source: Select Classes
ar: اختر الفئات

source: Place all the classes you want to generate code for in the right hand side list.
ar: ضع جميع الفئات التي تريد توليد الشيفرة لها في قائمة الجانب الأيمن.

source: Code Generation Selection
ar: اختيار توليد الشيفرة

source: Classes Available
ar: الفئات المتاحة

source: Add class for code generation
ar: أضف فئة لتوليد الشيفرة

source: Add >>
ar: أضف >>

source: Remove class from Code Generation
ar: أزل الفئة من توليد الشيفرة

source: << Remove
ar: << أزل

source: Classes Selected
ar: الفئات المختارة

source: Status of Code Generation Progress
ar: حالة تقدم توليد الشيفرة

source: Press the button Generate to start the code generation. Check the success state for every class.
ar: اضغط على زر ولّد لبدء توليد الشيفرة. تحقق من حالة النجاح لكل فئة.

source: Not Yet Generated
ar: لم تولّد بعد

source: Code Generated
ar: الشّيفرة المولّدة

source: Not Generated
ar: لم تولّد

source: Skipped
ar: تخطى

source: Cannot open file!
ar: تعذّر فتح الملفّ

source: Umbrello Code Generation - Logger Export
ar: توليد شيفرة أمبريلو - تصدير السجّل

source: Status
ar: الحالة

source: Class
ar: الفئة

source: Logger
ar: السجّل

source: Clear
ar: امحُ

source: Export...
ar: صدّر...

source: Generate
ar: ولّد

source: Importing file: %1 Progress: %2/%3
ar: استيراد الملف: %1 التقدم: %2/%3

# ready to status bar
source: Ready.
ar: جاهز.

# failed to status bar
source: Failed.
ar: فشل

source: Code Importing Wizard
ar: معالج استيراد الشيفرة

source: Code Importing Path
ar: مسار استيراد الشيفرة

source: Select the code importing path.
ar: اختر مسار استيراد الشيفرة.

source: File System Model
ar: نموذج نظام الملفات

source: Select the desired language to filter files.
ar: اختر اللغة المطلوبة لتصفية الملفات.

source: Select also all the files in the subdirectories.
ar: اختر أيضًا كل الملفات في المجلدات الفرعية.

source: Select all the files below the current directory.
ar: اختر كل الملفات تحت المجلد الحالي.

source: Clear all selections.
ar: أزل جميع الاختيارات.

source: Add file extensions like e.g. '*.h *.hpp'.
ar: أضف امتدادات ملفات مثل *.h *.hpp على سبيل المثال.

source: The language of the project.
ar: لغة المشروع.

source: Programming Language:
ar: لغة البرمجة:

source: Include Subdirectories.
ar: ضمّن المجلدات الفرعية.

source: List of file extensions:
ar: قائمة امتدادات الملفات:

source: Deselect all
ar: ألغي خيار الكلّ

source: Select all
ar: حدّد الكلّ

source: Number of files:
ar: عدد الملفات:

source: Status of Code Importing Progress
ar: حالة تقدم استيراد الشيفرة

source: Press the button 'Start import' to start the code import. Check the success state for every class.
ar: اضغط على زر 'ابدأ الاستيراد' لبدء استيراد الشيفرة. تحقق من حالة النجاح لكل فئة.

source: <b>Code import of 1 file:</b><br>
ar: <b>استيراد شيفرة لـ 0 ملف:</b><br>

source: importing file ... DONE<br>
ar: استيراد الملف ... انتهى<br>

source: Import Done
ar: اكتمل الاستيراد

source: importing file ... FAILED<br>
ar: استيراد الملف ... فشل<br>

source: Import Failed
ar: فشل الاستيراد

source: importing file ...
ar: استيراد الملف ...

source: importing file ... stopped<br>
ar: استيراد الملف ... أوقف<br>

source: Import stopped
ar: أوقف الاستيراد

source: Not Imported
ar: لم يستورد

source: Umbrello Code Import - Logger Export
ar: استيراد شيفرة أمبريلو - تصدير السجّل

source: Import Status
ar: حالة الاستيراد

source: Start import
ar: ابدأ الاستيراد

source: Stop
ar: أوقف

source: Importing file: %1
ar: استيراد الملف: %1

# show failed on status bar
source: Failed.
ar: فشل

# show Ready on status bar
source: Ready.
ar: جاهز.

source: No code importer for file: %1
ar: لا يوجد مستورد شيفرة للملف: %1

source: Class Name
ar: اسم الفئة

source: Properties
ar: الخصائص

source: Initial activity
ar: نشاط مبدئي

source: End activity
ar: نشاط نهاية

source: Final activity
ar: نشاط نهائي

source: Branch/Merge
ar: تفرّع/دمج

source: Invoke action
ar: استدعِ إجراء

source: Parameter activity
ar: نشاط معلمة

source: General Properties
ar: خصائص عامة

# general properties page
source: General
ar: عامّ

source: Activity type:
ar: نوع النشاط:

source: Activity name:
ar: اسم النّشاط

source: Precondition :
ar: شرط مبدئي:

source: Postcondition :
ar: شرط لاحق:

source: &Normal activity
ar: نشاط &عادي

source: &Invoke action
ar: ا&ستدعِ إجراء

source: &Parameter activity node
ar: عقدة نشاط ال&معلمة

source: Association Properties
ar: خصائص الترابط

# general settings page name
source: General
ar: عامّ

source: General Settings
ar: الإعدادات العامة

# display option page name
source: Display
ar: العرض

source: Display Options
ar: خيارات العرض

source: Attributes
ar: الصّفات

source: Attribute Settings
ar: إعدادات السمة

source: Operations
ar: العمليّات

source: Operation Settings
ar: إعدادات العملية

source: Templates
ar: القوالب

source: Templates Settings
ar: إعدادات القوالب

source: Enum Literals
ar: حروف تعداد حرفية

source: Enum Literals Settings
ar: إعدادات حروف التعداد الحرفية

source: Entity Attributes
ar: سمات الكيان

source: Entity Attributes Settings
ar: إعدادات سمات الكيان

source: Entity Constraints
ar: قيود الكيان

source: Entity Constraints Settings
ar: إعدادات قيود الكيان

# contents settings page name
source: Contents
ar: المحتويات

source: Contents Settings
ar: إعدادات المحتويات

source: Associations
ar: الترابطات

source: Class Associations
ar: ترابطات الفئة

# instance general settings page name
source: General
ar: عامّ

source: new_class
ar: فئة_جديدة

source: Class Wizard
ar: معالج الفئة

source: New Class
ar: فئة جديدة

source: Add general info about the new class.
ar: أضف معلومات عامة حول الفئة الجديدة.

source: Class Attributes
ar: سمات الفئة

source: Add attributes to the new class.
ar: أضف سمات إلى الفئة الجديدة.

source: Class Operations
ar: عمليات الفئة

source: Add operations to the new class.
ar: أضف عمليات إلى الفئة الجديدة.

source: Hide
ar: أخفِ

source: Show
ar: أظهر

source: Hide Comment
ar: أخفِ التعليق

source: Show Comment
ar: أظهر التعليق

source: Insert Code Block Before
ar: أدرج كتلة شيفرة قبل

source: Insert Code Block After
ar: أدرج كتلة شيفرة بعد

source: Copy
ar: انسخ

source: Paste
ar: ألصق

source: Cut
ar: قصّ

source: Code Viewer - %1
ar: عارض الشيفرة - %1

source: Show hidden blocks
ar: أظهر الكتل المخفية

source: <p align="center">component name here</p>
ar: <p align="center">اسم المكوّن هنا</p>

source: Show block type
ar: أظهر نوع الكتلة

source: Colors
ar: الألوان

source: Font:
ar: الخط:

source: Paper:
ar: الورقة:

source: Selected:
ar: المحدّد:

source: <p align="right">UML object block:</p>
ar: <p align="right">كتلة كائن UML:</p>

source: <p align="right">Hidden block:</p>
ar: <p align="right">كتلة مخفية:</p>

source: <p align="right">Uneditable text:</p>
ar: <p align="right">نص غير قابل للتحرير:</p>

source: <p align="right">Editable text:</p>
ar: <p align="right">نص قابل للتحرير:</p>

source: Enable all messages
ar: مكّن كلّ الرّسائل

source: Enable 'delete association' related messages
ar: فعّل الرسائل المتعلقة بـ 'إزالة الترابط'

source: Enable 'delete diagram' related messages
ar: فعّل الرسائل المتعلقة بـ 'إزالة المخطط'

source: You are about to delete an association. Do you really want to continue?
ar: أوشكت على حذف ارتباط. هل تريد المتابعة حقًا؟

source: Delete Association
ar: احذف الارتباط

source: You are about to delete the entire diagram. Are you sure?
ar: أوشكت على حذف المخطَّط بالكامل. هل أنت متأكد؟

source: Are you sure you want to delete diagram %1?
ar: هل أنت متأكد من رغبتك في حذف المخطط %1؟

source: Delete Diagram?
ar: أحذف المخطط؟

source: &Delete
ar: ا&حذف

source: Notifications
ar: الإشعارات

source: The format that the images will be exported to
ar: التنسيق الذي ستُصدَّر به الصور

source: Export All Views
ar: صدر كل المناظر

source: The base directory used to save the images
ar: المجلّد الأساسي المستخدَم لحفظ الصور

source: &Directory to save the diagrams in:
ar: &المجلّد لحفظ المخططات فيه:

source: Create in the target directory the same tree structure used in the document to store the views
ar: أنشئ في المجلّد الهدف نفس هيكل الشجرة المستخدَم في المستند لتخزين المناظر

source: The views are stored in folders in the document. The same tree structure used in the document to store the views can be created in the selected base directory with this option. Only the folders made by the user are created in the base directory (Logical view, use case view and so on are not created).
ar: تخزن المناظر في مجلدات ضمن المستند. يمكن إنشاء نفس هيكل الشجرة المستخدَم في المستند لتخزين المناظر في المجلد الأساسي المختار باستخدام هذا الخيار. فقط المجلدات التي أنشأها المستخدم هي التي تنشأ في المجلد الأساسي (المنظر المنطقي، منظر حالة الاستخدام، وغيرهما لا تُنشأ).

source: Use &folders
ar: استخدم الم&جلدات

source: Find
ar: اعثر

source: Filter
ar: المرشّح

source: Tree View
ar: عرض الشّجرة

source: &Current diagram
ar: &المخطط الحالي

source: &All diagrams
ar: &كل المخططات

source: Category
ar: الفئة

source: All
ar: الكلّ

source: Package
ar: الرزمة

source: Interface
ar: الواجهة

source: Operation
ar: العملية

source: Attribute
ar: الصّفات

source: Search Term:
ar: عبارة البحث:

source: Default
ar: المبدئيّ

# general settings
source: General
ar: عامّ

source: Font
ar: الخط

source: Font Settings
ar: إعدادات الخطّ

# widget style page
source: Style
ar: النّمط

source: Widget Style
ar: نمط الودجات:

# style page name
source: Style
ar: النّمط

source: Line Style
ar: نمط الخطّ

# role page name
source: Roles
ar: الأدوار

source: Role Settings
ar: إعدادات الدور

source: Note Properties
ar: خصائص الملاحظة

source: Central Buffer
ar: المخزن المؤقت المركزي

source: Data Store
ar: مخزن البيانات

source: ObjectFlow
ar: تدفق الكائن

# properties group title
source: Properties
ar: الخصائص

source: Object Node type:
ar: نوع عقدة الكائن:

source: Object Node name:
ar: اسم عقدة الكائن:

# enter state label
source: State :
ar: الحالة:

source: &Central Buffer
ar: المخزن المؤقت ال&مركزي

source: &Data Store
ar: &مخزن البيانات

source: &Object Flow
ar: &تدفق الكائن

source: Destination File Already Exists
ar: ملف الوجهة موجود بالفعل

source: &Overwrite
ar: ا&ستبدل

source: &Generate Similar File Name
ar: &أنتج اسم ملف مشابه

source: &Do Not Generate File
ar: &لا تُنشئ الملف

source: The file %1 already exists in %2. Umbrello can overwrite the file, generate a similar file name or not generate this file.
ar: الملف %1 موجود بالفعل في %2. يمكن لأمبريلو أن يكتب فوق الملف، أو ينتج اسم ملف مشابه، أو لا ينتج هذا الملف.

source: &Apply to all remaining files
ar: &طبّق على كل الملفات المتبقية

source: Activities
ar: الأنشطة

source: Move selected item to the top
ar: حرّك العنصر المختار إلى الأعلى

source: Move selected item up
ar: انقل العنصر المحدّد لأعلى

source: Move selected item down
ar: انقل العنصر المحدّد لأسفل

source: Move selected item to the bottom
ar: حرّك العنصر المختار إلى الأسفل

source: New Activity...
ar: نشاطًا جديدًا...

source: Delete
ar: احذف

source: Rename
ar: إعادة تسمية

# name of association widget
source: Name:
ar: الاسم:

source: Stereotype
ar: صورة نمطية

source: Type:
ar: النوع:

source: Role A Properties
ar: خصائص الدور أ

source: Role B Properties
ar: خصائص الدور ب

source: Role A Changeability
ar: قابلية تغيير الدور أ

source: Role B Changeability
ar: قابلية تغيير الدور ب

source: Rolename:
ar: اسم الدور:

source: Multiplicity:
ar: التعددية:

# changeability for A is changeable
source: Changeable
ar: قابل للتغيير

# changeability for A is frozen
source: Frozen
ar: مجمّد

# changeability for A is add only
source: Add only
ar: إضافة فقط

# changeability for B is changeable
source: Changeable
ar: قابل للتغيير

# changeability for B is frozen
source: Frozen
ar: مجمّد

# changeability for B is add only
source: Add only
ar: أضف فقط

source: Layout Generator
ar: مولّد التخطيط

source: <p>The auto layout feature depends on layout generators provided by the GraphViz package, which is normally installed aside Umbrello by a package manager.</p> <p>Umbrello has built in support for detecting the install location of these layout generators. For cases where this dependency is not available or do not fit, a different installation path could be provided.</p>
ar: <p>تعتمد ميزة التخطيط الآلي على مولدات تخطيط يوفرها حزمة GraphViz، التي تثبت عادةً بجانب أمبريلو بواسطة مدير حزم.</p> <p>أمبريلو يمتلك دعمًا مدمجًا لكشف موقع تثبيت مولدات التخطيط هذه. في الحالات التي لا يتوفر فيها هذا الاعتماد أو لا يتناسب، يمكن توفير مسار تثبيت مختلف.</p>

source: Auto detect layout generator
ar: اكشف آليًا عن مولّد التخطيط

source: Generator executable path:
ar: مسار ملف مولّد قابل للتنفيذ:

source: Miscellaneous
ar: متنوّع

source: <p>Dot file export is performed by using the export layout.</p><p>With this option checked, the export layout is added to the list of available diagram layouts and enables a quick dot export preview.</p>
ar: <p>يُجرى تصدير ملف Dot باستخدام تخطيط التصدير.</p><p>عند تحديد هذا الخيار، يضاف تخطيط التصدير إلى قائمة تخطيطات المخطط المتاحة ويفعّل معاينة تصدير Dot سريعة.</p>

source: Show export layout in diagram context menu
ar: اعرض تخطيط التصدير في قائمة سياق المخطط

source: Reference:
ar: المرجع:

source: A&bstract class
ar: تصنيف م&جرّد

source: A&bstract use case
ar: حالة استخدام م&جرّدة

# component is executable
source: &Executable
ar: ال&تنفيذيّ:

source: Draw as actor
ar: ارسم كفاعل

source: Multiple instance
ar: نسخة متعددة

source: Show destruction
ar: اعرض التدمير

source: The name you have chosen is already being used. The name has been reset.
ar: الاسم الذي اخترته مستخدَم بالفعل. أُعيد ضبط الاسم.

source: Name is Not Unique
ar: الاسم ليس فريدًا

source: N&ew Attribute...
ar: خاصية ج&ديدة...

source: N&ew Operation...
ar: ع&ملية جديدة...

source: N&ew Template...
ar: قالب جديد...

source: N&ew Enum Literal...
ar: حرفي تعداد &جديد...

source: N&ew Entity Attribute...
ar: خاصية كيان ج&ديدة...

source: Constraints
ar: القيود

source: N&ew Constraint...
ar: قيد ج&ديد...
