Repository: KDE/umbrello
Catalog: po/*/umbrello.po
Languages: ar

source: Instance Attribute
ar: خاصية نسخة

source: N&ew Instance Attribute...
ar: خاصية &نسخة جديدة...

source: &Properties
ar: &خصائص

source: Comment
ar: التعليق

source: Source Code
ar: الشيفرة المصدرية

source: &Documentation
ar: ال&توثيق

source: Operatio&ns
ar: ال&عمليّات

source: &Visibility
ar: ال&ظّهور

source: O&peration signature
ar: توقيع الع&ملية

source: Pac&kage
ar: ال&رزمة

source: Att&ributes
ar: ال&صّفات

source: Attr&ibute signature
ar: توقيع ال&خاصية

source: &Public Only
ar: ع&ام فقط

source: Draw as circle
ar: ارسم كدائرة

source: &Attribute associations
ar: ارتباطات ال&خاصية

source: Starting Scope
ar: نطاق البدء

source: Default attribute scope:
ar: النطاق مبدئي للخاصية:

source: Default operation scope:
ar: النطاق مبدئي للعملية:

source: Attribute Signatures
ar: توقيعات الخاصية

source: No Stereotype
ar: لا يوجد نمط طباعي

source: Stereotype Name
ar: اسم النمط الطباعي

source: Stereotype with Tags
ar: نمط طباعي مع وسم

source: Include search paths
ar: ضمّن مسارات البحث

source: Additional include search paths could be added by specifying environment variable UMBRELLO_INCPATH.
ar: يمكن إضافة مسارات تضمين إضافية عن طريق تحديد متغير البيئة UMBRELLO_INCPATH.

source: C++ Import
ar: استيراد ++C

source: For each imported file create an artifact in the component view
ar: أنشئ قطعة أثرية في منظر المكوّن لكل ملف مستورد

source: Resolve dependencies (reduces import speed)
ar: حلّ الاعتمادات (يقلل سرعة الاستيراد)

source: Enable C++11 standard (experimental)
ar: فعّل معيار C++11 (تجريبي)

source: Unique Constraint...
ar: قيد فريد...

source: Primary Key Constraint...
ar: قيد مفتاح أساسي...

source: Foreign Key Constraint...
ar: قيد مفتاح خارجي...

source: Check Constraint...
ar: قيد تدقيق...

source: <p align="center">No Options Available.</p>
ar: <p align="center">لا خيارات متوفّرة.</p>

source: &Diagrams
ar: &مخططات

source: &Select diagrams
ar: &اختر مخططات

source: &Type of diagram
ar: &نوع المخطط

# diagram selection for printing
source: Selection
ar: التحديد

source: No diagrams selected.
ar: لا يوجد مخططات مختارة.

source: The name you have entered is invalid.
ar: الاسم الذي أدخلته غير صالح.

source: Invalid Name
ar: الاسم غير صالح

source: The name you have entered is not unique.
ar: الاسم الذي أدخلته ليس فريدًا.

source: Name Not Unique
ar: الاسم ليس فريدًا

source: Diagram Properties
ar: خصائص المخطط

source: Name:
ar: الاسم:

source: Zoom:
ar: التّكبير:

source: Width:
ar: العرض:

source: Height:
ar: الارتفاع:

source: Show &grid
ar: اعرض الشـ&بكة

source: Snap &to grid
ar: &مطابقة للشبكة

source: Snap the size of the components to be a multiple of the grid spacing. If 'Snap to Grid' is enabled a component will always be aligned with the grid on all 4 sides.
ar: اجعل حجم المكونات مضاعفًا لمسافة شبكة النقاط. إذا فُعّل «التقط للشبكة» سيصبح المكوّن دائمًا محاذيًا للشبكة على جوانبه الأربعة.

source: Snap component size
ar: التقط حجم المكوّن

source: Grid spacing:
ar: مسافة شبكة النقاط:

source: X
ar: س

source: Y
ar: ص

source: Autoincrement Sequence
ar: تسلسل تزايدي آلي

# miscellaneous group box
source: Miscellaneous
ar: متنوّع

source: Enable undo
ar: فعّل التراجع

source: Use tabbed diagrams
ar: استخدم مخططات بألسنة

source: Use new C++/Java/Ruby generators
ar: استخدم مولدات ++C/Java/Ruby الجديدة

source: Turn on footer and page numbers when printing
ar: فعّل التذييل وأرقام الصفحات عند الطباعة

source: Enable UML2 support
ar: فعّل دعم UML2

source: Autosave
ar: حفظ آلي

source: E&nable autosave
ar: فعّل الحفظ ال&آلي

source: Select auto-save time interval (mins):
ar: اختر الفاصل الزمني للحفظ الآلي (بالدقائق):

source: Set autosave suffix:
ar: اضبط لاحقة الحفظ الآلي:

source: <qt><p>The autosave file will be saved to ~/autosave.xmi if the autosaving occurs before you have manually saved the file.</p><p>If you have already saved it, the autosave file will be saved in the same folder as the file and will be named like the file's name, followed by the suffix specified.</p><p>If the suffix is equal to the suffix of the file you have saved, the autosave will overwrite your file automatically.</p></qt>
ar: <qt><p>سيحفظ ملف الحفظ الآلي إلى ~/autosave.xmi إذا حدث الحفظ الآلي قبل أن تحفظ الملف يدويًا.</p><p>إذا كنت قد حفظته بالفعل، سيحفظ ملف الحفظ الآلي في نفس مجلد الملف وسيكون اسمه مثل اسم الملف، متبوعًا باللاحقة المحددة.</p><p>إذا كانت اللاحقة تساوي لاحقة الملف الذي حفظته، سيكتب الحفظ الآلي فوق ملفك آليًا.</p></qt>

source: Startup
ar: بدء التشغيل

source: &Load last project
ar: &حمّل المشروع الأخير

source: Start new project with:
ar: ابـدأ مشروعًا جديدًا بـ:

source: Default Language :
ar: اللغة المبدئيّة:

source: Contained Items
ar: العناصر المضمّنة

source: Select Operation
ar: اختر عملية

source: Sequence number:
ar: رقم التسلسل:

source: Auto increment:
ar: تزايد آلي:

source: Class operation:
ar: عملية التصنيف:

source: New Operation...
ar: عملية جديدة...

source: Custom operation:
ar: عملية مخصصة:

# General options
source: General
ar: عامّ

source: Right to left user interface
ar: واجهة من اليمين إلى اليسار

# Association options
source: Associations
ar: الارتباطات

source: Create new association lines as:
ar: أنشئ خطوط ارتباط جديدة كـ:

# color group box
source: Color
ar: اللون

source: Custom text color
ar: لون نص مخصص

source: Custom line color
ar: لون خط مخصص

source: Custom fill color
ar: لون تعبئة مخصص

source: Custom grid color
ar: لون شبكة نقاط مخصص

source: Custom background color
ar: لون خلفية مخصص

source: Custom line width
ar: عرض خط مخصص

source: &Use fill color
ar: ا&ستخدم لون التعبئة

source: Role Properties
ar: خصائص الدور

source: Role Visibility
ar: وضوح الدور

source: Implementation
ar: تنفيذ

source: Role Changeability
ar: قابلية تغيير الدور

source: Changeable
ar: قابل للتغيير

source: Frozen
ar: مجمّد

source: Add only
ar: إضافة فقط

# title of color group
source: Color
ar: اللون

# text color
source: &Text:
ar: ال&نص:

# default text color button
source: Defaul&t
ar: ال&مبدئيّ

# line color
source: &Line:
ar: ال&سّطر:

# default line color button
source: &Default
ar: الإ&فتراضيات

source: &Fill:
ar: ال&ملء:

# default fill color button
source: D&efault
ar: ال&مبدئيّ

source: &Use fill
ar: ا&ستعمل الملء

# background color
source: &Background:
ar: ال&خلفية:

# default background color button
source: De&fault
ar: ال&مبدئيّ

# grid dot color
source: &Grid dot:
ar: نقطة الشبكة &نقطة:

# default grid dot color button
source: Def&ault
ar: ال&مبدئيّ

# title of width group
source: Width
ar: العرض

source: Line &width:
ar: &عرض الخطّ:

# default line width button
source: Defa&ult
ar: ال&مبدئيّ

source: Layout of the line:
ar: تخطيط الخط:

source: Parameter Properties
ar: خصائص المعامل

# property name
source: &Name:
ar: الا&سم:

source: Passing Direction
ar: اتجاه التمرير

source: "in" is a readonly parameter, "out" is a writeonly parameter and "inout" is a parameter for reading and writing.
ar: "in" هو معامل للقراءة فقط، "out" هو معامل للكتابة فقط و "inout" هو معامل للقراءة والكتابة.

source: You have entered an invalid parameter name.
ar: أدخلت اسم معامل غير صالح.

source: Parameter Name Invalid
ar: اسم المعامل غير صالح

source: Select diagram
ar: اختر مخطط

source: Diagram
ar: رسم بياني

source: Umbrello Setup
ar: إعداد أمبريلو

source: User Interface
ar: واجهة المستخدم

source: User Interface Settings
ar: إعدادات واجهة المستخدم

# general settings page
source: General
ar: عامّ

# class settings page
source: Class
ar: الفئة

source: Class Settings
ar: إعدادات التصنيف

source: Code Importer
ar: مستورد الشفرة

source: Code Import Settings
ar: إعدادات استيراد الشفرة

source: Code Generation
ar: توليد الشيفرة

source: Code Generation Settings
ar: إعدادات توليد الشفرة

source: Code Viewer
ar: عارض الشفرة

source: Code Viewer Settings
ar: إعدادات عارض الشفرة

source: Auto Layout
ar: تخطيط آلي

source: Auto Layout Settings
ar: إعدادات التخطيط الآلي

source: Search
ar: بحث

# general page
source: General
ar: عام

# initial state in statechart
source: Initial state
ar: حالة مبدئية

# state in statechart
source: State
ar: الحالة

# end state in statechart
source: End state
ar: حالة النهاية

# fork state in statechart
source: Fork
ar: فرّع

# join state in statechart
source: Join
ar: انضم

# junction state in statechart
source: Junction
ar: وصلة

# deep history state in statechart
source: DeepHistory
ar: تاريخ عميق

# shallow history state in statechart
source: ShallowHistory
ar: تاريخ سطحي

# choice state in statechart
source: Choice
ar: اختيار

# combined state in statechart
source: Combined
ar: مدمجة

source: State type:
ar: نوع الحالة:

source: State name:
ar: اسم الحالة:

source: Linked diagram:
ar: مخطط مرتبط:

source: Stereotype Properties
ar: خصائص النمط الطباعي

source: Stereotype Attributes for
ar: خصائص النمط الطباعي لـ

# attribute name
source: &Name:
ar: الا&سم:

# attribute type
source: &Type:
ar: ال&نّوع:

# default value
source: &Default:
ar: ال&مبدئيّ:

source: Attribute Properties
ar: خصائص الخاصية

source: &Initial value:
ar: القيمة الأوّل&يّة:

source: Classifier &scope ("static")
ar: نطاق ال&تصنيف (ثابت)

source: You have entered an invalid attribute name.
ar: أدخلت اسم خاصية غير صالح.

source: Attribute Name Invalid
ar: اسم الخاصية غير صالح

source: The attribute name you have chosen is already being used in this operation.
ar: اسم الخاصية الذي اخترته مستخدَم بالفعل في هذه العملية.

source: Attribute Name Not Unique
ar: اسم الخاصية ليس فريدًا

source: Check Constraint Properties
ar: خصائص قيد التدقيق

# name label
source: Name
ar: الاسم

source: Check Condition :
ar: شرط التدقيق :

source: Entity Attribute Properties
ar: خصائص خاصية الكيان

# name of entity attribute
source: &Name:
ar: الا&سم:

source: Length/Values:
ar: الطول/القيم:

source: &Auto increment
ar: تزايد &آلي

source: Allow &null
ar: اسمح ب&فارغ

source: Attributes:
ar: الصّفات

source: Indexing
ar: يفهرس

source: &Not Indexed
ar: &غير مفهرس

source: &Indexed
ar: &مفهرس

source: You have entered an invalid entity attribute name.
ar: أدخلت اسم خاصية كيان غير صالح.

source: Entity Attribute Name Invalid
ar: اسم خاصية الكيان غير صالح

source: The entity attribute name you have chosen is already being used in this operation.
ar: اسم خاصية الكيان الذي اخترته مستخدَم بالفعل في هذه العملية.

source: Entity Attribute Name Not Unique
ar: اسم خاصية الكيان ليس فريدًا

source: EnumLiteral Properties
ar: خصائص حرفي التعداد

# literal name
source: &Name:
ar: الا&سم:

source: &Value:
ar: ال&قيمة:

source: Foreign Key Setup
ar: إعداد المفتاح الخارجي

# general page title
source: General
ar: عامّ

# general group title
source: General
ar: عامّ

# label for entering name
source: Name
ar: الاسم

source: Referenced Entity
ar: الكيان المشار إليه

source: Actions
ar: الإجراءات

source: On Update
ar: عند التحديث

source: On Delete
ar: عند الحذف

source: No Action
ar: لا إجراء

source: Restrict
ar: قيّد

source: Cascade
ar: تتالي

source: Set Null
ar: اضبط فارغ

source: Set Default
ar: اضبط المبدئي

source: Columns
ar: الأعمدة

# column header local
source: Local
ar: محليّ

# column header referenced
source: Referenced
ar: مشار إليه

source: Local Column
ar: عمود محلي

source: Referenced Column
ar: عمود مشار إليه

source: &Add
ar: أ&ضف

source: You are attempting to change the Referenced Entity of this ForeignKey Constraint. Any unapplied changes to the mappings between local and referenced entities will be lost. Are you sure you want to continue ?
ar: أنت تحاول تغيير الكيان المشار إليه لقيد المفتاح الخارجي هذا. أي تغييرات غير مطبقة على التعيينات بين الكيانات المحلية والمشار إليها ستضيع. هل أنت متأكد من رغبتك في المتابعة؟

source: Object Attribute Properties
ar: خصائص خاصية الكائن

source: You have entered an invalid attribute value.
ar: أدخلت قيمة خاصية غير صالحة.

source: Value Invalid
ar: القيمة غير صالحة

source: Attribute Name:
ar: اسم الخاصية:

source: Value:
ar: القيمة:

source: Operation Properties
ar: خصائص العملية

# operation name
source: &Name:
ar: الا&سم:

source: &Abstract operation
ar: عملية م&جرّدة

source: &Query ("const")
ar: &استعلام ("const")

source: &virtual
ar: ا&فتراضية

source: &inline
ar: مضمنة (&i)

source: &Override
ar: أ&بطل

source: Parameters
ar: المعاملات

source: Ne&w Parameter...
ar: معامل ج&ديد...

source: The parameter name you have chosen is already being used in this operation.
ar: اسم المعامل الذي اخترته مستخدَم بالفعل في هذه العملية.

source: Parameter Name Not Unique
ar: اسم المعامل ليس فريدًا

source: The parameter name you have chosen is already being used in this operation.
ar: اسم المعامل الذي اخترته مستخدَم بالفعل في هذه العملية.

source: You have entered an invalid operation name.
ar: أدخلت اسم عملية غير صالح.

source: Operation Name Invalid
ar: اسم العملية غير صالح

source: An operation with that signature already exists in %1.
ar: عملية بهذا التوقيع موجودة بالفعل في %1.

source: Choose a different name or parameter list.
ar: اختر اسمًا مختلفًا أو قائمة معاملات مختلفة.

source: Template Properties
ar: خصائص القالب

# template name
source: &Name:
ar: الا&سم:

source: You have entered an invalid template name.
ar: أدخلت اسم قالب غير صالح.

source: Template Name Invalid
ar: اسم القالب غير صالح

source: The template parameter name you have chosen is already being used in this operation.
ar: اسم معامل القالب الذي اخترته مستخدَم بالفعل في هذه العملية.

source: Template Name Not Unique
ar: اسم القالب ليس فريدًا

source: Unique Constraint Properties
ar: خصائص القيد الفريد

source: Attribute Details
ar: تفاصيل الخاصية

source: You have entered an invalid constraint name.
ar: أدخلت اسم قيد غير صالح.

source: Constraint Name Invalid
ar: اسم القيد غير صالح

# classes display options page
source: Display
ar: العرض

source: Classes Display Options
ar: خيارات عرض التصنيفات

# diagram style page
source: Style
ar: النّمط

source: Diagram Style
ar: نمط المخطط

source: &Default value:
ar: ال&قيمة المبدئية:

source: &Image type:
ar: &نوع الصّورة:

source: &Resolution:
ar: المي&ز:

source: DPI
ar: نقطة لكل بوصة

source: New
ar: جديد

source: &File
ar: &ملف

source: &Library
ar: م&كتبة

source: &Table
ar: &جدول

# draw as default
source: &Default
ar: &مبدئيّ

source: Draw As
ar: ارسم كـ

source: &Type:
ar: ال&نّوع:

# @action:button
source: Yes
ar: نعم

# @action:button
source: No
ar: لا

source: Package path:
ar: مسار الحزمة:

source: Stereotype &name:
ar: اسم النمط ال&طباعي:

# public visibility
source: P&ublic
ar: &عام

# protected visibility
source: Pro&tected
ar: &محمي

# private visibility
source: P&rivate
ar: &خاص

source: Imple&mentation
ar: ت&طبيق

source: Visibility
ar: الظّهور

# scope for A is public
source: Public
ar: عام

# scope for A is protected
source: Protected
ar: محمي

# scope for A is private
source: Private
ar: خاص

# scope for A is implementation
source: Implementation
ar: تنفيذ

source: Role A Visibility
ar: وضوح الدور أ

# scope for B is public
source: Public
ar: عام

# scope for B is protected
source: Protected
ar: محمي

# scope for B is private
source: Private
ar: خاص

# scope for B is implementation
source: Implementation
ar: التنفيذ

source: Role B Visibility
ar: وضوح الدور ب

source: Exporting to XHTML...
ar: أصدر إلى XHTML...

source: Exporting all views...
ar: أصدر كل المناظر...

source: Some errors happened when exporting the images:
ar: حدثت بعض الأخطاء أثناء تصدير الصور:

source: Generating Docbook...
ar: ولّد Docbook...

source: Docbook Generation Complete...
ar: اكتمل توليد Docbook...

source: Docbook Generation Failed...
ar: فشلت عملية إنشاء Docbook...

source: Exporting to DocBook...
ar: تصدير إلى DocBook...

source: Umbrello UML Modeller autonomous code generator
ar: مُنشئ الشيفرة آلياً لأمبريلو UML Modeller

source: (c) 2006 Gael de Chalendar (aka Kleag), (c) 2002-2006 Umbrello UML Modeller Authors
ar: (c) 2006 Gael de Chalendar (المعروف بـ Kleag)، (c) 2002-2006 مؤلفو أمبريلو UML Modeller

source: Gael de Chalendar (aka Kleag)
ar: Gael de Chalendar (المعروف بـ Kleag)

source: Umbrello UML Modeller Authors
ar: مؤلفو أمبريلو UML Modeller

source: File to transform
ar: الملف المراد تحويله

source: The XSLT file to use
ar: ملف XSLT المراد استخدامه

source: Generating XHTML...
ar: إنشاء XHTML...

source: XHTML Generation Complete...
ar: اكتمل إنشاء XHTML...

source: Copying CSS...
ar: نسخ CSS...

source: Finished Copying CSS...
ar: انتهى نسخ CSS...

source: Failed Copying CSS...
ar: فشل نسخ CSS...

source: Flag whether documentation was modified. Press left mouse button to apply modified content.
ar: علم ما إذا عُدلت الوثائق. اضغط زر الفأرة الأيسر لتطبيق المحتوى المعدل.

source: Documentation type
ar: نوع الوثائق

source: Activate documentation edit after focus change.
ar: فعّل تحرير الوثائق بعد تغيير التركيز.

source: Apply layout
ar: طبّق التخطيط

source: Umbrello UML Modeller
ar: أمبريلو UML Modeller

source: Umbrello – Visual development environment for software, based on the industry standard Unified Modelling Language (UML).<br/>See also <a href="http://www.omg.org/spec/">http://www.omg.org/spec/</a>.
ar: أمبريلو – بيئة تطوير مرئية للبرمجيات، ترتكز على لغة النمذجة الموحدة (UML) القياسية في الصناعة.<br/>انظر أيضاً <a href="http://www.omg.org/spec/">http://www.omg.org/spec/</a>.

source: Copyright © 2001 Paul Hensgen, Copyright © 2002-2022 Umbrello UML Modeller Authors
ar: حقوق النشر © 2001 Paul Hensgen، حقوق النشر © 2002-2022 مؤلفو أمبريلو UML Modeller

source: Author of initial version.
ar: مؤلف النسخة المبدئية.

source: Bug fixing, porting work, code cleanup, new features.
ar: إصلاح الأخطاء، أعمال النقل، تنظيف الشيفرة، المزايا الجديدة.

source: Porting work, code cleanup, new features.
ar: أعمال النقل، تنظيف الشيفرة، المزايا الجديدة.

source: Current maintainer.
ar: المُصان الحالي.

source: A lot of work for C++ and Java code generation. Codeeditor.
ar: عمل كثير على إنشاء شيفرات C++ و Java. محرر الشيفرة.

source: File to open
ar: الملف المراد فتحه

source: export diagrams to extension and exit
ar: صدّر المخططات إلى امتداد واخرج

source: list available export extensions
ar: اسرد امتدادات التصدير المتاحة

source: the local directory to save the exported diagrams in
ar: الدليل المحلي لحفظ المخططات المصدرة فيه

source: import files
ar: استورد الملفات

source: list supported languages
ar: اسرد اللغات المدعومة

source: keep the tree structure used to store the views in the document in the target directory
ar: احتفظ بهيكل الشجرة المستخدَم لتخزين المشاهدات في المستند داخل الدليل الهدف

source: import files from directory <dir>
ar: استورد الملفات من الدليل <dir>

source: set language
ar: اضبط اللغة

source: Delete Anchor
ar: احذف المرتكز

source: Add Point
ar: أضف نقطة

source: Delete Point
ar: احذف النقطة

source: Choose Spline points automatically
ar: اختر نقاط الشق آلياً

source: Change Association Name...
ar: غيّر اسم الترابط...

source: Change Role A Name...
ar: غيّر اسم الدور أ...

source: Change Role B Name...
ar: غيّر اسم الدور ب...

source: Select Operation...
ar: اختر العملية...

# Layout menu
source: Layout
ar: التخطيط

source: Polyline
ar: متعدد الأسطر

source: Direct
ar: مباشر

source: Spline
ar: شق

source: Orthogonal
ar: متعامد

source: New Template...
ar: قالب جديد...

source: Accept Signal
ar: اقبل الإشارة

source: Accept Time Event
ar: اقبل الحدث الزمني

source: Activity...
ar: النّشاط...

source: Activity Transition
ar: انتقال النشاط

source: Actor
ar: الممثّل

source: Artifact
ar: المصنوعة

source: Change Font...
ar: غيّر الخط...

source: Choice
ar: اختيار

# new class menu item
source: Class...
ar: الفئة...

# duplicate action
source: Duplicate
ar: كرّر

source: Collapse All
ar: اطوِ الكل

# add new combined state
source: Combined state...
ar: حالة مدمجة...

source: Component
ar: المكون

source: Folder
ar: المجلد

source: Datatype...
ar: نوع البيانات...

source: Deep History
ar: سجل عميق

source: Edit combined state
ar: حرّر الحالة المدمجة

source: End Activity
ar: إنهاء النشاط

source: End State
ar: حالة الإنهاء

source: Entity
ar: كيان

source: Entity Attribute...
ar: سمة الكيان...

source: Enum...
ar: تعداد...

source: Enum Literal...
ar: حرفي التعداد...

source: Expand All
ar: وسّع الكل

source: Export as Picture...
ar: صدّر كصورة...

source: Externalize Folder...
ar: اجعل المجلد خارجياً...

source: Fill Color...
ar: لون الملء...

source: Final Activity
ar: النشاط النهائي

source: Flip Horizontal
ar: اقلب أفقياً

source: Flip Vertical
ar: اقلب رأسياً

source: Text Line...
ar: سطر نصي...

source: Fork
ar: فرّع

source: Go to state diagram
ar: اذهب إلى مخطط الحالة

source: Hide destruction box
ar: أخفِ صندوق الإتلاف

source: Import File(s)...
ar: استورد ملف(ات)...

source: Import from Directory...
ar: استورد من دليل...

source: from file...
ar: من ملف...

source: Initial Activity
ar: النشاط المبدئي

source: Initial State
ar: الحالة المبدئية

# new instance menu item
source: Instance...
ar: نسخة…

source: New Attribute...
ar: سمة جديدة...

source: Provided interface
ar: الواجهة المقدمة

source: Required interface
ar: الواجهة المطلوبة

source: Internalize Folder
ar: اجعل المجلد داخلياً

source: Junction
ar: تقاطع

source: Line Color...
ar: لون الخطّ...

source: Asynchronous Message
ar: رسالة غير متزامنة

source: Creation Message
ar: رسالة الإنشاء

source: Destroy Message
ar: رسالة الإتلاف

source: Found Message
ar: رسالة عُثر عليها

source: Lost Message
ar: رسالة مفقودة

source: Synchronous Message
ar: رسالة متزامنة

source: New Entity Attribute...
ar: سمة كيان جديدة...

source: New Literal...
ar: حرفي جديد...

source: New Parameter...
ar: معامل جديد...

source: Node
ar: عقدة

source: Note...
ar: الملاحظة...

source: Object...
ar: الكائن...

source: Object Node
ar: عقدة الكائن

source: Open file
ar: افتح ملفًا

source: Package...
ar: الرزمة...

source: Pin
ar: دبوس

source: Port
ar: المنفذ

source: Pre Post Condition
ar: شرط ما قبل وما بعد

source: Redo
ar: كرّر

source: Region
ar: المنطقة

source: Remove
ar: أزل

source: Remove state diagram
ar: احذف مخطط الحالة

source: Rename...
ar: أعد التسمية...

source: Rename Object...
ar: أعد تسمية الكائن...

source: Return to combined state
ar: ارجع إلى الحالة المدمجة

source: Return to class
ar: ارجع إلى الصنف

source: Reset Label Positions
ar: صفّر مواضع لصائق

source: Resize
ar: غيّر الحجم

source: Select state diagram
ar: اختر مخطط الحالة

source: Send Signal
ar: أرسل إشارة

source: Shallow History
ar: سجل سطحي

source: Show destruction box
ar: أظهر صندوق الإتلاف

# add new state
source: State...
ar: الحالة...

source: Join
ar: ضم

source: Subsystem
ar: نظام فرعي

source: Template
ar: القالب

source: Undo
ar: تراجع

source: Use Case
ar: حالة الاستخدام

# new container menu
source: New
ar: جديد

# new sub menu
source: New
ar: جديد

# category type sub menu
source: Category Type
ar: نوع الفئة

source: Disjoint(Specialisation)
ar: منفصل (تخصص)

source: Overlapping(Specialisation)
ar: متداخل (تخصص)

source: Union
ar: اتحاد

source: Change into Class
ar: غيّر إلى صنف

source: Change into Package
ar: غيّر إلى حزمة

source: Clear Diagram
ar: امسح المخطط

source: Snap to Grid
ar: مطابقة للشبكة

source: Snap Component Size to Grid
ar: التقط حجم المكون إلى الشبكة

source: Show Grid
ar: أظهر الشبيكة

source: Show Documentation Indicator
ar: أظهر دليل الوثائق

source: apply '%1'
ar: طبّق '%1'

source: Public Only
ar: علني فقط

source: Operation Signature
ar: توقيع العملية

source: Attribute Signature
ar: توقيع السمة

source: Show Signatures
ar: أظهر التواقيع

source: Hide Signatures
ar: أخفِ التواقيع

source: Hide Non-public members
ar: أخفِ الأعضاء غير العلنيين

source: Show Non-public members
ar: أظهر الأعضاء غير العلنيين

source: Packages
ar: الحزم

source: Stereotypes
ar: الصور النمطية

source: Refactor
ar: أعد الهيكلة

source: View Code
ar: اعرض الشيفرة

source: Change into Interface
ar: غيّر إلى واجهة

source: Draw as Circle
ar: ارسم كدائرة

source: Rename Class...
ar: أعد تسمية الصنف...

source: Name as Tooltip
ar: الاسم كتلميح أداة

source: Move Up
ar: انقل لأعلى

source: Move Down
ar: انقل لأسفل

# clear note
source: Clear
ar: امحُ

source: Change Text...
ar: غيّر النص…

source: Auto resize
ar: تحجيم آليّ
