Repository: KDE/umbrello
Catalog: po/*/umbrello.po
Languages: ar

source: Change State Name...
ar: غيّر اسم الحالة...

source: Change Activity Name...
ar: غيّر اسم النشاط...

source: Change Object Node Name...
ar: غيّر اسم عقدة الكائن...

# clear precondition
source: Clear
ar: امحُ

source: Add Interaction Operand
ar: أضف معامل تفاعل

# clear combined fragment
source: Clear
ar: امحُ

source: Change Multiplicity...
ar: غيّر التعددية...

source: Change Name
ar: غيّر الاسم

# color menu
source: Color
ar: اللون

source: Use Fill Color
ar: استخدم لون التعبئة

source: No Fill Color
ar: لا يوجد لون تعبئة

# align menu
source: Align
ar: حاذِ إلى

source: Align Right
ar: حاذِ يمينًا

source: Align Left
ar: حاذِ يسارًا

source: Align Top
ar: حاذ لأعلى

source: Align Bottom
ar: حاذ لأسفل

source: Align Vertical Middle
ar: حاذِ الوسط عمودياً

source: Align Horizontal Middle
ar: حاذِ الوسط أفقياً

source: Align Vertical Distribute
ar: حاذِ التوزيع عمودياً

source: Align Horizontal Distribute
ar: حاذِ التوزيع أفقياً

source: new_actor
ar: فاعل_جديد

source: new_artifact
ar: مصنوعة_جديدة

source: new_association
ar: ترابط_جديد

source: new_attribute
ar: سمة_جديدة

source: new_category
ar: فئة_جديدة

source: new_check_constraint
ar: قيد_تحقق_جديد

source: new_component
ar: مكون_جديد

source: new_datatype
ar: نوع_بيانات_جديد

source: new_entity
ar: كيان_جديد

source: new_entity_attribute
ar: سمة_كيان_جديدة

source: new_entity_constraint
ar: قيد_كيان_جديد

source: new_enum
ar: تعداد_جديد

source: new_enum_literal
ar: حرفي_تعداد_جديد

source: new_folder
ar: مجلد_جديد

source: new_foreign_key_constraint
ar: قيد_مفتاح_خارجي_جديد

source: new_instance
ar: نسخة_جديدة

source: new_instance_attribute
ar: سمة_نسخة_جديدة

source: new_interface
ar: واجهة_جديدة

source: new_node
ar: عقدة_جديدة

source: new_operation
ar: عملية_جديدة

source: new_package
ar: حزمة_جديدة

source: new_port
ar: منفذ_جديد

source: new_role
ar: دور_جديد

source: new_stereotype
ar: صورة_نمطية_جديدة

source: new_template
ar: قالب_جديد

source: new_unique_constraint
ar: قيد_فريد_جديد

source: new_use_case
ar: حالة_استخدام_جديدة

source: new_object
ar: كائن_جديد

source: New actor
ar: فاعل جديد

source: New artifact
ar: مصنوعة جديدة

source: New association
ar: ترابط جديد

source: New attribute
ar: سمة جديدة

source: New category
ar: فئة جديدة

source: New check constraint
ar: قيد تحقق جديد

source: New class
ar: طبقة جديدة

source: New component
ar: مكون جديد

source: New datatype
ar: نوع بيانات جديد

source: New entity
ar: كيان جديد

source: New entity attribute
ar: سمة كيان جديدة

source: New entity constraint
ar: قيد كيان جديد

source: New enum
ar: تعداد جديد

source: New enum literal
ar: حرفي تعداد جديد

source: New folder
ar: مجلد جديد

source: New foreign key constraint
ar: قيد مفتاح خارجي جديد

source: New instance
ar: نسخة جديدة

source: New instance attribute
ar: سمة نسخة جديدة

source: New interface
ar: واجهة جديدة

source: New node
ar: عقدة جديدة

source: New operation
ar: عملية جديدة

source: New package
ar: حزمة جديدة

source: New port
ar: منفذ جديد

source: New role
ar: دور جديد

source: New stereotype
ar: صورة نمطية جديدة

source: New template
ar: قالب جديد

source: New unique constraint
ar: قيد فريد جديد

source: New use case
ar: حالة استخدام جديدة

source: New UML object
ar: كائن UML جديد

source: Enter the name of the new actor:
ar: أدخل اسم الفاعل الجديد:

source: Enter the name of the new artifact:
ar: أدخل اسم المصنوعة الجديدة:

source: Enter the name of the new association:
ar: أدخل اسم الترابط الجديد:

source: Enter the name of the new attribute:
ar: أدخل اسم السمة الجديدة:

source: Enter the name of the new category:
ar: أدخل اسم الفئة الجديدة:

source: Enter the name of the new check constraint:
ar: أدخل اسم قيد التحقق الجديد:

source: Enter the name of the new class:
ar: أدخل اسم الصنف الجديد:

source: Enter the name of the new component:
ar: أدخل اسم المكون الجديد:

source: Enter the name of the new datatype:
ar: أدخل اسم نوع البيانات الجديد:

source: Enter the name of the new entity:
ar: أدخل اسم الكيان الجديد:

source: Enter the name of the new entity attribute:
ar: أدخل اسم سمة الكيان الجديدة:

source: Enter the name of the new entity constraint:
ar: أدخل اسم قيد الكيان الجديد:

source: Enter the name of the new enum:
ar: أدخل اسم التعداد الجديد:

source: Enter the name of the new enum literal:
ar: أدخل اسم حرفي التعداد الجديد:

source: Enter the name of the new folder:
ar: أدخل اسم المجلد الجديد:

source: Enter the name of the new foreign key constraint:
ar: أدخل اسم قيد المفتاح الخارجي الجديد:

source: Enter the name of the new instance:
ar: أدخل اسم النسخة الجديدة:

source: Enter the name of the new instance attribute:
ar: أدخل اسم سمة النسخة الجديدة:

source: Enter the name of the new interface:
ar: أدخل اسم الواجهة الجديدة:

source: Enter the name of the new node:
ar: أدخل اسم العقدة الجديدة:

source: Enter the name of the new operation:
ar: أدخل اسم العملية الجديدة:

source: Enter the name of the new package:
ar: أدخل اسم الحزمة الجديدة:

source: Enter the name of the new port:
ar: أدخل اسم المنفذ الجديد:

source: Enter the name of the new role:
ar: أدخل اسم الدور الجديد:

source: Enter the name of the new stereotype:
ar: أدخل اسم الصورة النمطية الجديدة:

source: Enter the name of the new template:
ar: أدخل اسم القالب الجديد:

source: Enter the name of the new unique constraint:
ar: أدخل اسم القيد الفريد الجديد:

source: Enter the name of the new use case:
ar: أدخل اسم حالة الاستخدام الجديدة:

source: Enter the name of the new UML object
ar: أدخل اسم كائن UML الجديد

source: Rename actor
ar: أعد تسمية الفاعل

source: Rename artifact
ar: أعد تسمية المصنوعة

source: Rename association
ar: أعد تسمية الترابط

source: Rename attribute
ar: أعد تسمية السمة

source: Rename category
ar: أعد تسمية الفئة

source: Rename check constraint
ar: أعد تسمية قيد التحقق

source: Rename class
ar: أعد تسمية الصنف

source: Rename component
ar: أعد تسمية المكون

source: Rename datatype
ar: أعد تسمية نوع البيانات

source: Rename entity
ar: أعد تسمية الكيان

source: Rename entity attribute
ar: أعد تسمية سمة الكيان

source: Rename entity constraint
ar: أعد تسمية قيد الكيان

source: Rename enum
ar: أعد تسمية التعداد

source: Rename enum literal
ar: أعد تسمية حرفي التعداد

source: Rename folder
ar: إعادة تسمية مجلّد

source: Rename foreign key constraint
ar: أعد تسمية قيد المفتاح الخارجي

source: Rename instance
ar: أعد تسمية النسخة

source: Rename instance attribute
ar: أعد تسمية سمة النسخة

source: Rename interface
ar: أعد تسمية الواجهة

source: Rename node
ar: أعد تسمية العقدة

source: Rename operation
ar: أعد تسمية العملية

source: Rename package
ar: أعد تسمية الحزمة

source: Rename port
ar: أعد تسمية المنفذ

source: Rename role
ar: أعد تسمية الدور

source: Rename stereotype
ar: أعد تسمية النمط المقولب

source: Rename template
ar: أعد تسمية القالب

source: Rename unique constraint
ar: أعد تسمية قيد التفرد

source: Rename use case
ar: أعد تسمية حالة الاستخدام

source: Rename UML object
ar: أعد تسمية كائن UML

source: Enter the new name of the actor:
ar: أدخل الاسم الجديد للفاعل:

source: Enter the new name of the artifact:
ar: أدخل الاسم الجديد للمصنوع:

source: Enter the new name of the association:
ar: أدخل الاسم الجديد للارتباط:

source: Enter the new name of the attribute:
ar: أدخل الاسم الجديد للسمة:

source: Enter the new name of the category:
ar: أدخل الاسم الجديد للفئة:

source: Enter the new name of the check constraint:
ar: أدخل الاسم الجديد لقيد التحقق:

source: Enter the new name of the class:
ar: أدخل الاسم الجديد للصنف:

source: Enter the new name of the component:
ar: أدخل الاسم الجديد للمركّب:

source: Enter the new name of the datatype:
ar: أدخل الاسم الجديد لنوع البيانات:

source: Enter the new name of the entity:
ar: أدخل الاسم الجديد للكيان:

source: Enter the new name of the entity attribute:
ar: أدخل الاسم الجديد لسمة الكيان:

source: Enter the new name of the entity constraint:
ar: أدخل الاسم الجديد لقيد الكيان:

source: Enter the new name of the enum:
ar: أدخل الاسم الجديد للمُعدِّد:

source: Enter the new name of the enum literal:
ar: أدخل الاسم الجديد لحرف المُعدِّد:

source: Enter the new name of the folder:
ar: أدخل الاسم الجديد للمجلد:

source: Enter the new name of the foreign key constraint:
ar: أدخل الاسم الجديد لقيد المفتاح الأجنبي:

source: Enter the new name of the instance:
ar: أدخل الاسم الجديد للنسخة:

source: Enter the new name of the instance attribute:
ar: أدخل الاسم الجديد لسمة النسخة:

source: Enter the new name of the interface:
ar: أدخل الاسم الجديد للواجهة:

source: Enter the new name of the node:
ar: أدخل الاسم الجديد للعقدة:

source: Enter the new name of the operation:
ar: أدخل الاسم الجديد للعملية:

source: Enter the new name of the package:
ar: أدخل الاسم الجديد للحزمة:

source: Enter the new name of the port:
ar: أدخل الاسم الجديد للمنفذ:

source: Enter the new name of the role:
ar: أدخل الاسم الجديد للدور:

source: Enter the new name of the stereotype:
ar: أدخل الاسم الجديد للنمط المقولب:

source: Enter the new name of the template:
ar: أدخل الاسم الجديد للقالب:

source: Enter the new name of the unique constraint:
ar: أدخل الاسم الجديد لقيد التفرد:

source: Enter the new name of the use case:
ar: أدخل الاسم الجديد لحالة الاستخدام:

source: Enter the new name of the UML object
ar: أدخل الاسم الجديد لكائن UML

source: OK
ar: حسنًا

# parse status
source: Empty
ar: فارغ

source: Malformed argument
ar: وسيط غير سليم البنية

source: Unknown argument type
ar: نوع وسيط غير معروف

source: Illegal method name
ar: اسم دالة غير قانوني

source: Unknown return type
ar: نوع عائد غير معروف

source: Unspecified error
ar: خطأ غير محدد

source: Name
ar: الاسم

source: Type
ar: النّوع

source: Widgets/Associations
ar: ودجت/ارتباطات

source: ID
ar: المعرّف

source: Saved
ar: محفوظ

source: Parent
ar: والدان

source: Pointer
ar: المؤشر

source: Usage
ar: الاستخدام

source: That is an invalid name.
ar: هذا اسم غير صالح.

source: This is a reserved keyword for the language of the configured code generator.
ar: هذه كلمة محجوزة للغة مولد الشيفرة المضبوط.

source: Reserved Keyword
ar: كلمة محجوزة

source: That name is already being used.
ar: ذلك الاسم قيد الاستخدام بالفعل.

source: Not a Unique Name
ar: ليس اسماً فريداً

source: Add Base Class
ar: أضف صنف أساس

source: Add Derived Class
ar: أضف صنف مشتق

source: Add Operation
ar: أضف عملية

source: Add Attribute
ar: أضف سمة

source: Add Base Interface
ar: أضف واجهة أساس

source: Add Derived Interface
ar: أضف واجهة مشتقة

source: Base Classifiers
ar: مصنفات الأساس

source: Derived Classifiers
ar: المصنفات المشتقة

source: An attribute with that name already exists in %1.
ar: سمة بذلك الاسم موجودة بالفعل في %1.

source: Choose a different name.
ar: اختر اسماً مختلفاً.

source: Incorrect use of associations.
ar: استخدام غير صحيح للارتباطات.

source: Association Error
ar: خطأ ارتباط

source: destroy
ar: دمّر

source: Enter Activity Name
ar: أدخل اسم النشاط

source: new activity
ar: نشاط جديد

source: Enter the name of the new activity:
ar: أدخل اسم النشاط الجديد:

source: Enter Signal Name
ar: أدخل اسم الإشارة

source: Enter Signal
ar: أدخل الإشارة

source: new Signal
ar: إشارة جديدة

source: Enter Time Event Name
ar: أدخل اسم حدث الوقت

source: Enter Time Event
ar: أدخل حدث الوقت

source: new time event
ar: حدث وقت جديد

source: Enter Combined Fragment Name
ar: أدخل اسم الشظية المدمجة

source: Enter the Combined Fragment
ar: أدخل الشظية المدمجة

source: new Combined Fragment
ar: شظية مدمجة جديدة

source: Enter State Name
ar: أدخل اسم الحالة

source: new state
ar: حالة جديدة

source: Enter the name of the new state:
ar: أدخل اسم الحالة الجديدة:

source: Geometry
ar: الأبعاد

source: Image Mime Type
ar: نوع MIME للصورة

source: The Mime Type of the Images
ar: نوع MIME للصور

source: Undo Support
ar: دعم التراجع

source: Undo Support is enabled when this is true
ar: مكّن دعم التراجع عندما يكون هذا صحيحاً

source: Tabbed Diagrams
ar: مخططات ذات ألسنة

source: Enables/Disables Tabbed View of Diagrams in the view area
ar: مكّن/عطّل عرض الألسنة للمخططات في منطقة العرض

source: New Code Generator
ar: مولد الشيفرة الجديد

source: Enables/Disables Support for the New Code Generator
ar: مكّن/عطّل دعم مولد الشيفرة الجديد

source: Layout Type
ar: نوع التخطيط

source: The layout type to use for new lines
ar: نوع التخطيط للاستخدام في الأسطر الجديدة

source: Footer Printing
ar: طباعة التذييل

source: Enables/Disables Support for footer printing
ar: مكّن/عطّل دعم طباعة التذييل

source: Auto Save
ar: حفظ آليّ

source: Enables/Disables Auto Saving at Regular Intervals
ar: مكّن/عطّل الحفظ الآلي على فترات منتظمة

source: Auto Save Time ( Old )
ar: وقت الحفظ الآلي (قديم)

source: Auto Save Time Interval ( Old )
ar: فاصل وقت الحفظ الآلي (قديم)

source: Auto Save Suffix
ar: لاحقة الحفظ الآلي

source: The Suffix for the auto save file
ar: اللاحقة لملف الحفظ الآلي

source: Load Last
ar: حمّل الأخير

source: Enables/Disables Loading of the last open file
ar: مكّن/عطّل تحميل آخر ملف مفتوح

source: Diagram To Load at Startup
ar: المخطط للتحميل عند البدء

source: The Diagram to load at startup
ar: المخطط للتحميل عند البدء

source: Default Language at Startup
ar: اللغة المبدئية عند البدء

source: The Language that Umbrello should start with by default
ar: اللغة التي يجب أن يبدأ بها أمبريلو مبدئياً

source: Use UML-2.x Notation
ar: استخدم تدوين UML-2.x

source: Enables/Disables UML2 notation
ar: مكّن/عطّل تدوين UML2

source: Enables/Disables usage of fill color
ar: مكّن/عطّل استخدام لون التعبئة

source: Fill Color
ar: لون التعبئة

source: The Fill Color to be used
ar: لون التعبئة للاستخدام

source: Line Color
ar: لون الخطّ

source: The Color of the Lines
ar: لون الخطوط

source: Line Width
ar: عرض الخطّ

source: The Width of the Line
ar: عرض الخط

source: Text Color
ar: لون النّصّ

source: The Color of the Text
ar: لون النص

source: Show Doc Window
ar: أظهر نافذة المستند

source: Enables/Disables showing of the doc window
ar: مكّن/عطّل إظهار نافذة المستند

source: The Font to be used
ar: الخط للاستخدام

source: Background Color
ar: لون الخلفية

source: The Color of the diagram background
ar: لون خلفية المخطط

source: Use background color
ar: استخدم لون الخلفية

source: Enables/Disables the usage of a custom background color
ar: مكّن/عطّل استخدام لون خلفية مخصص

source: Grid Dot Color
ar: لون نقاط الشبكة

source: The Color of the grid dots
ar: لون نقاط الشبكة

source: Enable/disable user interface direction from right to left
ar: مكّن/عطّل اتجاه واجهة المستخدم من اليمين إلى اليسار

source: Show Visibility
ar: أظهر الإظهارية

source: Show the Visibility of the Attributes ( eg: private, public, protected)
ar: أظهر إظهارية السمات (مثل: خاص، عام، محمي)

source: Show Attributes
ar: أظهر السمات

source: Show attributes of the class
ar: أظهر سمات الصنف

source: Show Operations
ar: أظهر العمليات

source: Show Package
ar: أظهر الحزمة

source: Enables/Disables showing of packages
ar: مكّن/عطّل إظهار الحزم

source: Show Stereotypes
ar: أظهر الأنماط المقولبة

source: Show Attribute Associations
ar: أظهر ارتباطات السمات

source: Show Public Only
ar: أظهر العام فقط

source: Enables/Disables showing of public attributes/methods
ar: مكّن/عطّل إظهار السمات/الدوال العامة

source: Show Attribute Signature
ar: أظهر توقيع السمة

source: Show Operation Signature
ar: أظهر توقيع العملية

source: Show operation signature
ar: أظهر توقيع العملية

source: Default Attribute Scope
ar: نطاق السمة المبدئي

source: Default Operation Scope
ar: نطاق العملية المبدئي

source: Height
ar: الارتفاع

source: Height of the code viewer
ar: ارتفاع عارض الشيفرة

source: Width
ar: العرض

source: Width of the Code Viewer
ar: عرض عارض الشيفرة

source: Show Hidden Blocks
ar: أظهر الكتل المخفية

source: Highlight Blocks
ar: ميّز الكتل

source: Enables/Disables Highlighting of blocks
ar: مكّن/عطّل تمييز الكتل

source: Font to be used in the Code Viewer
ar: الخط للاستخدام في عارض الشيفرة

source: Paper Color
ar: لون الورق

source: Color of the Paper
ar: لون الورقة

source: Font Color
ar: لون الخط

source: Color of the Font
ar: لون الخط

source: Selected Color
ar: لون التّحديد

# Color of the Edit Block
source: Edit Block Color
ar: لون كتلة التحرير

source: Color of the Edit Block
ar: لون كتلة التحرير

source: Non Edit Block Color
ar: لون كتلة غير قابلة للتحرير

source: UML Object Color
ar: لون كائن UML

source: Color of the UML Object
ar: لون كائن UML

source: Hidden Color
ar: لون مخفي

source: Create Artifacts for imported files
ar: أنشئ مصنوعات للملفات المستوردة

source: Create an artifact in the component view for each imported file
ar: أنشئ مصنوعاً في عرض المركّبات لكل ملف مستورد

source: Resolve dependencies
ar: حل التبعيات

source: Resolve dependencies when importing file
ar: حل التبعيات عند استيراد الملف

source: Support C++11 standard
ar: ادعم معيار C++11

source: Support C++11 standard on code import
ar: ادعم معيار C++11 عند استيراد الشيفرة

source: Auto Generate Empty Constructors
ar: ولّد منشئات فارغة آلياً

source: Enables/Disables Auto Generation of Empty Constructors
ar: مكّن/عطّل التوليد الآلي للمنشئات الفارغة

source: Comment Style
ar: نمط التعليق

source: Sets the Style of Comments to be used
ar: اضبط نمط التعليقات للاستخدام

source: Default Association Field Scope
ar: نطاق حقل الارتباط المبدئي

source: Sets the default Association field scope
ar: اضبط نطاق حقل الارتباط المبدئي

source: Default Attribute Accessor Scope
ar: نطاق وصول السمة المبدئي

source: Sets the default attribute accessor scope
ar: اضبط نطاق وصول السمة المبدئي

source: Force Documentation
ar: اجعل التوثيق إلزامياً

source: Enables/Disables Verbose Documentation
ar: مكّن/عطّل التوثيق المطول

source: Section Comment Policy
ar: سياسة تعليق القسم

source: Whether section comments shall be written
ar: هل يجب كتابة تعليقات القسم

source: Headings Directory
ar: دليل العناوين

source: The Path in which the headings are stored
ar: المسار الذي تخزن فيه العناوين

source: Include headings
ar: ضمّن العناوين

source: Enables/Disables inclusion of headings
ar: مكّن/عطّل تضمين العناوين

source: Indentation Amount
ar: مقدار المسافة البادئة

source: The amount of indentation
ar: مقدار المسافة البادئة

source: Indentation Type
ar: نوع المسافة البادئة

source: The Type of Indentation
ar: نوع المسافة البادئة

source: Line Ending Type
ar: نوع نهاية السطر

source: The type of line ending ( or new line type )
ar: نوع نهاية السطر (أو نوع السطر الجديد)

source: Modifier Name Policy
ar: سياسة اسم المُعدِّل

source: Output Directory
ar: مجلّد الإخراج

source: The directory to which the code has to be outputted
ar: المجلد الذي يجب أن تُخرج إليه الشيفرة

source: The policy to be followed when there are name conflicts
ar: السياسة التي يجب اتباعها عندما تحدث تعارضات في الأسماء

source: Auto Generate Accessors
ar: ولّد الوُصَلات آلياً

source: Enables/Disables auto generation of accessors
ar: مكّن/عطّل التوليد الآلي للوُصَلات

source: The prefix for class members
ar: البادئة لأعضاء الصنف

source: Inline Accessors
ar: وُصَلات مُضمنة

source: Enables/Disables Inline accessors
ar: مكّن/عطّل الوُصَلات المضمنة

source: Inline operations
ar: عمليات مضمنة

source: Enables/Disables Inline Operations
ar: مكّن/عطّل العمليات المضمنة

source: Package is namespace
ar: الحزمة هي نطاق اسم

source: Enables/Disables treating a package as a namespace
ar: مكّن/عطّل معالجة الحزمة كنطاق اسم

source: Public Accessors
ar: وُصَلات عامة

source: Enables/Disables public accessors
ar: مكّن/عطّل الوُصَلات العامة

source: String Class Name
ar: اسم صنف السلسلة

source: The name of the string class
ar: اسم صنف السلسلة

source: String Class Name Include
ar: تضمين اسم صنف السلسلة

source: The name of the string class to be included
ar: اسم صنف السلسلة المراد تضمينه

source: String Include is Global
ar: تضمين السلسلة عام

source: Enables/Disables global inclusion of string
ar: مكّن/عطّل التضمين العام للسلسلة

source: Vector Class Name
ar: اسم صنف المتجه

source: The name of the vector class
ar: اسم صنف المتجه

source: Vector Class Name Include
ar: تضمين اسم صنف المتجه

source: The name of the vector class to be included
ar: اسم صنف المتجه المراد تضمينه

source: Vector include is global
ar: تضمين المتجه عام

source: Enables/Disables global inclusion of vector class
ar: مكّن/عطّل التضمين العام لصنف المتجه

source: Virtual Destructors
ar: مدمّرات افتراضية

source: Enables/Disables virtual destructors
ar: مكّن/عطّل المدمّرات الافتراضية

source: Getters with 'get' prefix
ar: المُحصّلات ذات البادئة 'get'

source: If enabled, create getters with 'get' prefix
ar: إن مُكِّن، أنشئ مُحصّلات ذات بادئة 'get'

source: Remove prefix '[a-zA-Z]_' from accessor methods
ar: أزل البادئة '[a-zA-Z]_' من دالات الوُصول

source: If enabled, remove prefix '[a-zA-Z]_' from accessor methods
ar: إن مُكِّن، أزل البادئة '[a-zA-Z]_' من دالات الوُصول

source: If enabled, accessor methods start with capital letters
ar: إن مُكِّن، تبدأ دالات الوُصول بحروف كبيرة

source: Documentation tags
ar: وُسُوم التوثيق

source: The tag used for generating doxygen documentation (\\, @)
ar: الوَسم المستخدَم لتوليد توثيق دوكسجين (\\، @)

source: Auto Generate Attribute Accessors ( D )
ar: ولّد وُصَلات السمة آلياً (D)

source: Enables/Disables auto generation of attribute accessors ( D )
ar: مكّن/عطّل التوليد الآلي لوُصَلات السمة (D)

source: Auto Generate Assoc Accessors ( D )
ar: ولّد وُصَلات الارتباط آلياً (D)

source: Enables/Disables auto generation of association accessors ( D )
ar: مكّن/عطّل التوليد الآلي لوُصَلات الارتباط (D)

source: Build ANT Document (D)
ar: ابنِ مستند ANT (D)

source: Enables/Disables building of ANT Document (D)
ar: مكّن/عطّل بناء مستند ANT (D)

source: Auto Generate Attribute Accessors (Java)
ar: ولّد وُصَلات السمة آلياً (Java)

source: Enables/Disables auto generation of attribute accessors (Java)
ar: مكّن/عطّل التوليد الآلي لوُصَلات السمة (Java)

source: Auto Generate Assoc Accessors (Java)
ar: ولّد وُصَلات الارتباط آلياً (Java)

source: Enables/Disables auto generation of association accessors (Java)
ar: مكّن/عطّل التوليد الآلي لوُصَلات الارتباط (Java)

source: Build ANT Document (Java)
ar: ابنِ مستند ANT (Java)

source: Enables/Disables building of ANT Document (Java)
ar: مكّن/عطّل بناء مستند ANT (Java)

source: Auto Generate Attribute Accessors (Ruby)
ar: ولّد وُصَلات السمة آلياً (Ruby)

source: Enables/Disables auto generation of attribute accessors (Ruby)
ar: مكّن/عطّل التوليد الآلي لمُوصِّلات سمة (روبي)

source: Auto Generate Assoc Accessors (Ruby)
ar: ولّد آليًّا مُوصِّلات الترافق (روبي)

source: Enables/Disables auto generation of association accessors (Ruby)
ar: مكّن/عطّل التوليد الآلي لمُوصِّلات الترافق (روبي)

source: Automatic Dot Path
ar: مسار النقطة الآلي

source: determine automatically the path of dot executable
ar: حدّد آليًّا مسار ملف dot القابل للتنفيذ

source: Dot Path
ar: مسار النقطة

source: set path to dot executable (optional)
ar: اضبط مسار ملف dot القابل للتنفيذ (اختياري)

source: Show Export Layout
ar: أظهِر تخطيط التصدير

source: show export layout
ar: أظهِر تخطيط التصدير

source: &Export model
ar: &صدّر النموذج

source: &Edit
ar: ت&حرير

source: &View
ar: &عرض

source: &Show/hide window
ar: اعرض/أخفِ الشـ&بكة

source: &Diagram
ar: رسم توضيحي

source: &New
ar: &جديد

source: Sh&ow
ar: أ&ظهر

source: &Zoom
ar: &كبر

source: &Align
ar: حا&ذِ

source: &Code
ar: &كود

source: Active &Language
ar: ال&لغة النشطة

source: &Settings
ar: إ&عدادات

source: &Export model to DocBook
ar: &صدّر النموذج إلى DocBook

source: &Export model to XHTML
ar: &صدّر النموذج إلى XHTML

source: &New Class Wizard...
ar: مساعد &فئة جديدة...

source: &Add Default Datatypes for Active Language
ar: &أضِف أنواع بيانات مبدئية للغة النشطة

source: Code &Importing Wizard...
ar: مساعد &استيراد الشفرة...

source: &Code Generation Wizard...
ar: مساعد &توليد الشفرة...

source: &Generate All Code
ar: &ولّد كل الشفرة

source: Creates a new document
ar: ينشئ مستندًا جديدًا

source: Opens an existing document
ar: يفتح مستندًا موجودًا

source: Opens a recently used file
ar: يفتح ملفًّا مستخدم مؤخّرًا

source: Saves the document
ar: يحفظ المستند

source: Saves the document as...
ar: يحفظ المستند باسم...
